/* automatically generated by rust-bindgen 0.69.4 */

pub const OPENXR_H_: u32 = 1;
pub const XR_VERSION_1_0: u32 = 1;
pub const OPENXR_PLATFORM_DEFINES_H_: u32 = 1;
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const WCHAR_MIN: u32 = 0;

pub const XR_EXT_hand_tracking_data_source_SPEC_VERSION: u32 = 1;
pub const XR_EXT_HAND_TRACKING_DATA_SOURCE_EXTENSION_NAME: &[u8; 33] =
    b"XR_EXT_hand_tracking_data_source\0";
pub const XR_EXT_plane_detection: u32 = 1;
pub const XR_EXT_plane_detection_SPEC_VERSION: u32 = 1;
pub const XR_EXT_PLANE_DETECTION_EXTENSION_NAME: &[u8; 23] = b"XR_EXT_plane_detection\0";
pub const XR_OPPO_controller_interaction: u32 = 1;
pub const XR_OPPO_controller_interaction_SPEC_VERSION: u32 = 1;
pub const XR_OPPO_CONTROLLER_INTERACTION_EXTENSION_NAME: &[u8; 31] =
    b"XR_OPPO_controller_interaction\0";
pub const XR_EXT_future: u32 = 1;
pub const XR_EXT_future_SPEC_VERSION: u32 = 1;
pub const XR_EXT_FUTURE_EXTENSION_NAME: &[u8; 14] = b"XR_EXT_future\0";
pub const XR_NULL_FUTURE_EXT: u32 = 0;
pub const XR_EXT_user_presence: u32 = 1;
pub const XR_EXT_user_presence_SPEC_VERSION: u32 = 1;
pub const XR_EXT_USER_PRESENCE_EXTENSION_NAME: &[u8; 21] = b"XR_EXT_user_presence\0";
pub const XR_ML_user_calibration: u32 = 1;
pub const XR_ML_user_calibration_SPEC_VERSION: u32 = 1;
pub const XR_ML_USER_CALIBRATION_EXTENSION_NAME: &[u8; 23] = b"XR_ML_user_calibration\0";
pub const XR_YVR_controller_interaction: u32 = 1;
pub const XR_YVR_controller_interaction_SPEC_VERSION: u32 = 1;
pub const XR_YVR_CONTROLLER_INTERACTION_EXTENSION_NAME: &[u8; 30] =
    b"XR_YVR_controller_interaction\0";
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type XrVersion = u64;
pub type XrFlags64 = u64;
pub type XrSystemId = u64;
pub type XrBool32 = u32;
pub type XrPath = u64;
pub type XrTime = i64;
pub type XrDuration = i64;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInstance_T {
    _unused: [u8; 0],
}
pub type XrInstance = *mut XrInstance_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSession_T {
    _unused: [u8; 0],
}
pub type XrSession = *mut XrSession_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpace_T {
    _unused: [u8; 0],
}
pub type XrSpace = *mut XrSpace_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrAction_T {
    _unused: [u8; 0],
}
pub type XrAction = *mut XrAction_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchain_T {
    _unused: [u8; 0],
}
pub type XrSwapchain = *mut XrSwapchain_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSet_T {
    _unused: [u8; 0],
}
pub type XrActionSet = *mut XrActionSet_T;
pub const XrResult_XR_SUCCESS: XrResult = 0;
pub const XrResult_XR_TIMEOUT_EXPIRED: XrResult = 1;
pub const XrResult_XR_SESSION_LOSS_PENDING: XrResult = 3;
pub const XrResult_XR_EVENT_UNAVAILABLE: XrResult = 4;
pub const XrResult_XR_SPACE_BOUNDS_UNAVAILABLE: XrResult = 7;
pub const XrResult_XR_SESSION_NOT_FOCUSED: XrResult = 8;
pub const XrResult_XR_FRAME_DISCARDED: XrResult = 9;
pub const XrResult_XR_ERROR_VALIDATION_FAILURE: XrResult = -1;
pub const XrResult_XR_ERROR_RUNTIME_FAILURE: XrResult = -2;
pub const XrResult_XR_ERROR_OUT_OF_MEMORY: XrResult = -3;
pub const XrResult_XR_ERROR_API_VERSION_UNSUPPORTED: XrResult = -4;
pub const XrResult_XR_ERROR_INITIALIZATION_FAILED: XrResult = -6;
pub const XrResult_XR_ERROR_FUNCTION_UNSUPPORTED: XrResult = -7;
pub const XrResult_XR_ERROR_FEATURE_UNSUPPORTED: XrResult = -8;
pub const XrResult_XR_ERROR_EXTENSION_NOT_PRESENT: XrResult = -9;
pub const XrResult_XR_ERROR_LIMIT_REACHED: XrResult = -10;
pub const XrResult_XR_ERROR_SIZE_INSUFFICIENT: XrResult = -11;
pub const XrResult_XR_ERROR_HANDLE_INVALID: XrResult = -12;
pub const XrResult_XR_ERROR_INSTANCE_LOST: XrResult = -13;
pub const XrResult_XR_ERROR_SESSION_RUNNING: XrResult = -14;
pub const XrResult_XR_ERROR_SESSION_NOT_RUNNING: XrResult = -16;
pub const XrResult_XR_ERROR_SESSION_LOST: XrResult = -17;
pub const XrResult_XR_ERROR_SYSTEM_INVALID: XrResult = -18;
pub const XrResult_XR_ERROR_PATH_INVALID: XrResult = -19;
pub const XrResult_XR_ERROR_PATH_COUNT_EXCEEDED: XrResult = -20;
pub const XrResult_XR_ERROR_PATH_FORMAT_INVALID: XrResult = -21;
pub const XrResult_XR_ERROR_PATH_UNSUPPORTED: XrResult = -22;
pub const XrResult_XR_ERROR_LAYER_INVALID: XrResult = -23;
pub const XrResult_XR_ERROR_LAYER_LIMIT_EXCEEDED: XrResult = -24;
pub const XrResult_XR_ERROR_SWAPCHAIN_RECT_INVALID: XrResult = -25;
pub const XrResult_XR_ERROR_SWAPCHAIN_FORMAT_UNSUPPORTED: XrResult = -26;
pub const XrResult_XR_ERROR_ACTION_TYPE_MISMATCH: XrResult = -27;
pub const XrResult_XR_ERROR_SESSION_NOT_READY: XrResult = -28;
pub const XrResult_XR_ERROR_SESSION_NOT_STOPPING: XrResult = -29;
pub const XrResult_XR_ERROR_TIME_INVALID: XrResult = -30;
pub const XrResult_XR_ERROR_REFERENCE_SPACE_UNSUPPORTED: XrResult = -31;
pub const XrResult_XR_ERROR_FILE_ACCESS_ERROR: XrResult = -32;
pub const XrResult_XR_ERROR_FILE_CONTENTS_INVALID: XrResult = -33;
pub const XrResult_XR_ERROR_FORM_FACTOR_UNSUPPORTED: XrResult = -34;
pub const XrResult_XR_ERROR_FORM_FACTOR_UNAVAILABLE: XrResult = -35;
pub const XrResult_XR_ERROR_API_LAYER_NOT_PRESENT: XrResult = -36;
pub const XrResult_XR_ERROR_CALL_ORDER_INVALID: XrResult = -37;
pub const XrResult_XR_ERROR_GRAPHICS_DEVICE_INVALID: XrResult = -38;
pub const XrResult_XR_ERROR_POSE_INVALID: XrResult = -39;
pub const XrResult_XR_ERROR_INDEX_OUT_OF_RANGE: XrResult = -40;
pub const XrResult_XR_ERROR_VIEW_CONFIGURATION_TYPE_UNSUPPORTED: XrResult = -41;
pub const XrResult_XR_ERROR_ENVIRONMENT_BLEND_MODE_UNSUPPORTED: XrResult = -42;
pub const XrResult_XR_ERROR_NAME_DUPLICATED: XrResult = -44;
pub const XrResult_XR_ERROR_NAME_INVALID: XrResult = -45;
pub const XrResult_XR_ERROR_ACTIONSET_NOT_ATTACHED: XrResult = -46;
pub const XrResult_XR_ERROR_ACTIONSETS_ALREADY_ATTACHED: XrResult = -47;
pub const XrResult_XR_ERROR_LOCALIZED_NAME_DUPLICATED: XrResult = -48;
pub const XrResult_XR_ERROR_LOCALIZED_NAME_INVALID: XrResult = -49;
pub const XrResult_XR_ERROR_GRAPHICS_REQUIREMENTS_CALL_MISSING: XrResult = -50;
pub const XrResult_XR_ERROR_RUNTIME_UNAVAILABLE: XrResult = -51;
pub const XrResult_XR_ERROR_EXTENSION_DEPENDENCY_NOT_ENABLED: XrResult = -1000710001;
pub const XrResult_XR_ERROR_PERMISSION_INSUFFICIENT: XrResult = -1000710000;
pub const XrResult_XR_ERROR_ANDROID_THREAD_SETTINGS_ID_INVALID_KHR: XrResult = -1000003000;
pub const XrResult_XR_ERROR_ANDROID_THREAD_SETTINGS_FAILURE_KHR: XrResult = -1000003001;
pub const XrResult_XR_ERROR_CREATE_SPATIAL_ANCHOR_FAILED_MSFT: XrResult = -1000039001;
pub const XrResult_XR_ERROR_SECONDARY_VIEW_CONFIGURATION_TYPE_NOT_ENABLED_MSFT: XrResult =
    -1000053000;
pub const XrResult_XR_ERROR_CONTROLLER_MODEL_KEY_INVALID_MSFT: XrResult = -1000055000;
pub const XrResult_XR_ERROR_REPROJECTION_MODE_UNSUPPORTED_MSFT: XrResult = -1000066000;
pub const XrResult_XR_ERROR_COMPUTE_NEW_SCENE_NOT_COMPLETED_MSFT: XrResult = -1000097000;
pub const XrResult_XR_ERROR_SCENE_COMPONENT_ID_INVALID_MSFT: XrResult = -1000097001;
pub const XrResult_XR_ERROR_SCENE_COMPONENT_TYPE_MISMATCH_MSFT: XrResult = -1000097002;
pub const XrResult_XR_ERROR_SCENE_MESH_BUFFER_ID_INVALID_MSFT: XrResult = -1000097003;
pub const XrResult_XR_ERROR_SCENE_COMPUTE_FEATURE_INCOMPATIBLE_MSFT: XrResult = -1000097004;
pub const XrResult_XR_ERROR_SCENE_COMPUTE_CONSISTENCY_MISMATCH_MSFT: XrResult = -1000097005;
pub const XrResult_XR_ERROR_DISPLAY_REFRESH_RATE_UNSUPPORTED_FB: XrResult = -1000101000;
pub const XrResult_XR_ERROR_COLOR_SPACE_UNSUPPORTED_FB: XrResult = -1000108000;
pub const XrResult_XR_ERROR_SPACE_COMPONENT_NOT_SUPPORTED_FB: XrResult = -1000113000;
pub const XrResult_XR_ERROR_SPACE_COMPONENT_NOT_ENABLED_FB: XrResult = -1000113001;
pub const XrResult_XR_ERROR_SPACE_COMPONENT_STATUS_PENDING_FB: XrResult = -1000113002;
pub const XrResult_XR_ERROR_SPACE_COMPONENT_STATUS_ALREADY_SET_FB: XrResult = -1000113003;
pub const XrResult_XR_ERROR_UNEXPECTED_STATE_PASSTHROUGH_FB: XrResult = -1000118000;
pub const XrResult_XR_ERROR_FEATURE_ALREADY_CREATED_PASSTHROUGH_FB: XrResult = -1000118001;
pub const XrResult_XR_ERROR_FEATURE_REQUIRED_PASSTHROUGH_FB: XrResult = -1000118002;
pub const XrResult_XR_ERROR_NOT_PERMITTED_PASSTHROUGH_FB: XrResult = -1000118003;
pub const XrResult_XR_ERROR_INSUFFICIENT_RESOURCES_PASSTHROUGH_FB: XrResult = -1000118004;
pub const XrResult_XR_ERROR_UNKNOWN_PASSTHROUGH_FB: XrResult = -1000118050;
pub const XrResult_XR_ERROR_RENDER_MODEL_KEY_INVALID_FB: XrResult = -1000119000;
pub const XrResult_XR_RENDER_MODEL_UNAVAILABLE_FB: XrResult = 1000119020;
pub const XrResult_XR_ERROR_MARKER_NOT_TRACKED_VARJO: XrResult = -1000124000;
pub const XrResult_XR_ERROR_MARKER_ID_INVALID_VARJO: XrResult = -1000124001;
pub const XrResult_XR_ERROR_MARKER_DETECTOR_PERMISSION_DENIED_ML: XrResult = -1000138000;
pub const XrResult_XR_ERROR_MARKER_DETECTOR_LOCATE_FAILED_ML: XrResult = -1000138001;
pub const XrResult_XR_ERROR_MARKER_DETECTOR_INVALID_DATA_QUERY_ML: XrResult = -1000138002;
pub const XrResult_XR_ERROR_MARKER_DETECTOR_INVALID_CREATE_INFO_ML: XrResult = -1000138003;
pub const XrResult_XR_ERROR_MARKER_INVALID_ML: XrResult = -1000138004;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_INCOMPATIBLE_ML: XrResult = -1000139000;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_UNAVAILABLE_ML: XrResult = -1000139001;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_FAIL_ML: XrResult = -1000139002;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_IMPORT_EXPORT_PERMISSION_DENIED_ML: XrResult =
    -1000139003;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_PERMISSION_DENIED_ML: XrResult = -1000139004;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_ALREADY_EXISTS_ML: XrResult = -1000139005;
pub const XrResult_XR_ERROR_LOCALIZATION_MAP_CANNOT_EXPORT_CLOUD_MAP_ML: XrResult = -1000139006;
pub const XrResult_XR_ERROR_SPATIAL_ANCHOR_NAME_NOT_FOUND_MSFT: XrResult = -1000142001;
pub const XrResult_XR_ERROR_SPATIAL_ANCHOR_NAME_INVALID_MSFT: XrResult = -1000142002;
pub const XrResult_XR_SCENE_MARKER_DATA_NOT_STRING_MSFT: XrResult = 1000147000;
pub const XrResult_XR_ERROR_SPACE_MAPPING_INSUFFICIENT_FB: XrResult = -1000169000;
pub const XrResult_XR_ERROR_SPACE_LOCALIZATION_FAILED_FB: XrResult = -1000169001;
pub const XrResult_XR_ERROR_SPACE_NETWORK_TIMEOUT_FB: XrResult = -1000169002;
pub const XrResult_XR_ERROR_SPACE_NETWORK_REQUEST_FAILED_FB: XrResult = -1000169003;
pub const XrResult_XR_ERROR_SPACE_CLOUD_STORAGE_DISABLED_FB: XrResult = -1000169004;
pub const XrResult_XR_ERROR_PASSTHROUGH_COLOR_LUT_BUFFER_SIZE_MISMATCH_META: XrResult = -1000266000;
pub const XrResult_XR_ENVIRONMENT_DEPTH_NOT_AVAILABLE_META: XrResult = 1000291000;
pub const XrResult_XR_ERROR_HINT_ALREADY_SET_QCOM: XrResult = -1000306000;
pub const XrResult_XR_ERROR_NOT_AN_ANCHOR_HTC: XrResult = -1000319000;
pub const XrResult_XR_ERROR_SPACE_NOT_LOCATABLE_EXT: XrResult = -1000429000;
pub const XrResult_XR_ERROR_PLANE_DETECTION_PERMISSION_DENIED_EXT: XrResult = -1000429001;
pub const XrResult_XR_ERROR_FUTURE_PENDING_EXT: XrResult = -1000469001;
pub const XrResult_XR_ERROR_FUTURE_INVALID_EXT: XrResult = -1000469002;
pub const XrResult_XR_ERROR_EXTENSION_DEPENDENCY_NOT_ENABLED_KHR: XrResult = -1000710001;
pub const XrResult_XR_ERROR_PERMISSION_INSUFFICIENT_KHR: XrResult = -1000710000;
pub const XrResult_XR_RESULT_MAX_ENUM: XrResult = 2147483647;
pub type XrResult = ::std::os::raw::c_int;
pub const XrStructureType_XR_TYPE_UNKNOWN: XrStructureType = 0;
pub const XrStructureType_XR_TYPE_API_LAYER_PROPERTIES: XrStructureType = 1;
pub const XrStructureType_XR_TYPE_EXTENSION_PROPERTIES: XrStructureType = 2;
pub const XrStructureType_XR_TYPE_INSTANCE_CREATE_INFO: XrStructureType = 3;
pub const XrStructureType_XR_TYPE_SYSTEM_GET_INFO: XrStructureType = 4;
pub const XrStructureType_XR_TYPE_SYSTEM_PROPERTIES: XrStructureType = 5;
pub const XrStructureType_XR_TYPE_VIEW_LOCATE_INFO: XrStructureType = 6;
pub const XrStructureType_XR_TYPE_VIEW: XrStructureType = 7;
pub const XrStructureType_XR_TYPE_SESSION_CREATE_INFO: XrStructureType = 8;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_CREATE_INFO: XrStructureType = 9;
pub const XrStructureType_XR_TYPE_SESSION_BEGIN_INFO: XrStructureType = 10;
pub const XrStructureType_XR_TYPE_VIEW_STATE: XrStructureType = 11;
pub const XrStructureType_XR_TYPE_FRAME_END_INFO: XrStructureType = 12;
pub const XrStructureType_XR_TYPE_HAPTIC_VIBRATION: XrStructureType = 13;
pub const XrStructureType_XR_TYPE_EVENT_DATA_BUFFER: XrStructureType = 16;
pub const XrStructureType_XR_TYPE_EVENT_DATA_INSTANCE_LOSS_PENDING: XrStructureType = 17;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SESSION_STATE_CHANGED: XrStructureType = 18;
pub const XrStructureType_XR_TYPE_ACTION_STATE_BOOLEAN: XrStructureType = 23;
pub const XrStructureType_XR_TYPE_ACTION_STATE_FLOAT: XrStructureType = 24;
pub const XrStructureType_XR_TYPE_ACTION_STATE_VECTOR2F: XrStructureType = 25;
pub const XrStructureType_XR_TYPE_ACTION_STATE_POSE: XrStructureType = 27;
pub const XrStructureType_XR_TYPE_ACTION_SET_CREATE_INFO: XrStructureType = 28;
pub const XrStructureType_XR_TYPE_ACTION_CREATE_INFO: XrStructureType = 29;
pub const XrStructureType_XR_TYPE_INSTANCE_PROPERTIES: XrStructureType = 32;
pub const XrStructureType_XR_TYPE_FRAME_WAIT_INFO: XrStructureType = 33;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_PROJECTION: XrStructureType = 35;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_QUAD: XrStructureType = 36;
pub const XrStructureType_XR_TYPE_REFERENCE_SPACE_CREATE_INFO: XrStructureType = 37;
pub const XrStructureType_XR_TYPE_ACTION_SPACE_CREATE_INFO: XrStructureType = 38;
pub const XrStructureType_XR_TYPE_EVENT_DATA_REFERENCE_SPACE_CHANGE_PENDING: XrStructureType = 40;
pub const XrStructureType_XR_TYPE_VIEW_CONFIGURATION_VIEW: XrStructureType = 41;
pub const XrStructureType_XR_TYPE_SPACE_LOCATION: XrStructureType = 42;
pub const XrStructureType_XR_TYPE_SPACE_VELOCITY: XrStructureType = 43;
pub const XrStructureType_XR_TYPE_FRAME_STATE: XrStructureType = 44;
pub const XrStructureType_XR_TYPE_VIEW_CONFIGURATION_PROPERTIES: XrStructureType = 45;
pub const XrStructureType_XR_TYPE_FRAME_BEGIN_INFO: XrStructureType = 46;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_PROJECTION_VIEW: XrStructureType = 48;
pub const XrStructureType_XR_TYPE_EVENT_DATA_EVENTS_LOST: XrStructureType = 49;
pub const XrStructureType_XR_TYPE_INTERACTION_PROFILE_SUGGESTED_BINDING: XrStructureType = 51;
pub const XrStructureType_XR_TYPE_EVENT_DATA_INTERACTION_PROFILE_CHANGED: XrStructureType = 52;
pub const XrStructureType_XR_TYPE_INTERACTION_PROFILE_STATE: XrStructureType = 53;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_ACQUIRE_INFO: XrStructureType = 55;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_WAIT_INFO: XrStructureType = 56;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_RELEASE_INFO: XrStructureType = 57;
pub const XrStructureType_XR_TYPE_ACTION_STATE_GET_INFO: XrStructureType = 58;
pub const XrStructureType_XR_TYPE_HAPTIC_ACTION_INFO: XrStructureType = 59;
pub const XrStructureType_XR_TYPE_SESSION_ACTION_SETS_ATTACH_INFO: XrStructureType = 60;
pub const XrStructureType_XR_TYPE_ACTIONS_SYNC_INFO: XrStructureType = 61;
pub const XrStructureType_XR_TYPE_BOUND_SOURCES_FOR_ACTION_ENUMERATE_INFO: XrStructureType = 62;
pub const XrStructureType_XR_TYPE_INPUT_SOURCE_LOCALIZED_NAME_GET_INFO: XrStructureType = 63;
pub const XrStructureType_XR_TYPE_SPACES_LOCATE_INFO: XrStructureType = 1000471000;
pub const XrStructureType_XR_TYPE_SPACE_LOCATIONS: XrStructureType = 1000471001;
pub const XrStructureType_XR_TYPE_SPACE_VELOCITIES: XrStructureType = 1000471002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_CUBE_KHR: XrStructureType = 1000006000;
pub const XrStructureType_XR_TYPE_INSTANCE_CREATE_INFO_ANDROID_KHR: XrStructureType = 1000008000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_DEPTH_INFO_KHR: XrStructureType = 1000010000;
pub const XrStructureType_XR_TYPE_VULKAN_SWAPCHAIN_FORMAT_LIST_CREATE_INFO_KHR: XrStructureType =
    1000014000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_PERF_SETTINGS_EXT: XrStructureType = 1000015000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_CYLINDER_KHR: XrStructureType = 1000017000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_EQUIRECT_KHR: XrStructureType = 1000018000;
pub const XrStructureType_XR_TYPE_DEBUG_UTILS_OBJECT_NAME_INFO_EXT: XrStructureType = 1000019000;
pub const XrStructureType_XR_TYPE_DEBUG_UTILS_MESSENGER_CALLBACK_DATA_EXT: XrStructureType =
    1000019001;
pub const XrStructureType_XR_TYPE_DEBUG_UTILS_MESSENGER_CREATE_INFO_EXT: XrStructureType =
    1000019002;
pub const XrStructureType_XR_TYPE_DEBUG_UTILS_LABEL_EXT: XrStructureType = 1000019003;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_OPENGL_WIN32_KHR: XrStructureType = 1000023000;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_OPENGL_XLIB_KHR: XrStructureType = 1000023001;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_OPENGL_XCB_KHR: XrStructureType = 1000023002;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_OPENGL_WAYLAND_KHR: XrStructureType = 1000023003;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_OPENGL_KHR: XrStructureType = 1000023004;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_OPENGL_KHR: XrStructureType = 1000023005;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_OPENGL_ES_ANDROID_KHR: XrStructureType =
    1000024001;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_OPENGL_ES_KHR: XrStructureType = 1000024002;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_OPENGL_ES_KHR: XrStructureType = 1000024003;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_VULKAN_KHR: XrStructureType = 1000025000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_VULKAN_KHR: XrStructureType = 1000025001;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_VULKAN_KHR: XrStructureType = 1000025002;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_D3D11_KHR: XrStructureType = 1000027000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_D3D11_KHR: XrStructureType = 1000027001;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_D3D11_KHR: XrStructureType = 1000027002;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_D3D12_KHR: XrStructureType = 1000028000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_D3D12_KHR: XrStructureType = 1000028001;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_D3D12_KHR: XrStructureType = 1000028002;
pub const XrStructureType_XR_TYPE_SYSTEM_EYE_GAZE_INTERACTION_PROPERTIES_EXT: XrStructureType =
    1000030000;
pub const XrStructureType_XR_TYPE_EYE_GAZE_SAMPLE_TIME_EXT: XrStructureType = 1000030001;
pub const XrStructureType_XR_TYPE_VISIBILITY_MASK_KHR: XrStructureType = 1000031000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VISIBILITY_MASK_CHANGED_KHR: XrStructureType =
    1000031001;
pub const XrStructureType_XR_TYPE_SESSION_CREATE_INFO_OVERLAY_EXTX: XrStructureType = 1000033000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_MAIN_SESSION_VISIBILITY_CHANGED_EXTX: XrStructureType =
    1000033003;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_COLOR_SCALE_BIAS_KHR: XrStructureType =
    1000034000;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_CREATE_INFO_MSFT: XrStructureType = 1000039000;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_SPACE_CREATE_INFO_MSFT: XrStructureType =
    1000039001;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_IMAGE_LAYOUT_FB: XrStructureType = 1000040000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_ALPHA_BLEND_FB: XrStructureType = 1000041001;
pub const XrStructureType_XR_TYPE_VIEW_CONFIGURATION_DEPTH_RANGE_EXT: XrStructureType = 1000046000;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_EGL_MNDX: XrStructureType = 1000048004;
pub const XrStructureType_XR_TYPE_SPATIAL_GRAPH_NODE_SPACE_CREATE_INFO_MSFT: XrStructureType =
    1000049000;
pub const XrStructureType_XR_TYPE_SPATIAL_GRAPH_STATIC_NODE_BINDING_CREATE_INFO_MSFT:
    XrStructureType = 1000049001;
pub const XrStructureType_XR_TYPE_SPATIAL_GRAPH_NODE_BINDING_PROPERTIES_GET_INFO_MSFT:
    XrStructureType = 1000049002;
pub const XrStructureType_XR_TYPE_SPATIAL_GRAPH_NODE_BINDING_PROPERTIES_MSFT: XrStructureType =
    1000049003;
pub const XrStructureType_XR_TYPE_SYSTEM_HAND_TRACKING_PROPERTIES_EXT: XrStructureType = 1000051000;
pub const XrStructureType_XR_TYPE_HAND_TRACKER_CREATE_INFO_EXT: XrStructureType = 1000051001;
pub const XrStructureType_XR_TYPE_HAND_JOINTS_LOCATE_INFO_EXT: XrStructureType = 1000051002;
pub const XrStructureType_XR_TYPE_HAND_JOINT_LOCATIONS_EXT: XrStructureType = 1000051003;
pub const XrStructureType_XR_TYPE_HAND_JOINT_VELOCITIES_EXT: XrStructureType = 1000051004;
pub const XrStructureType_XR_TYPE_SYSTEM_HAND_TRACKING_MESH_PROPERTIES_MSFT: XrStructureType =
    1000052000;
pub const XrStructureType_XR_TYPE_HAND_MESH_SPACE_CREATE_INFO_MSFT: XrStructureType = 1000052001;
pub const XrStructureType_XR_TYPE_HAND_MESH_UPDATE_INFO_MSFT: XrStructureType = 1000052002;
pub const XrStructureType_XR_TYPE_HAND_MESH_MSFT: XrStructureType = 1000052003;
pub const XrStructureType_XR_TYPE_HAND_POSE_TYPE_INFO_MSFT: XrStructureType = 1000052004;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_SESSION_BEGIN_INFO_MSFT:
    XrStructureType = 1000053000;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_STATE_MSFT: XrStructureType =
    1000053001;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_FRAME_STATE_MSFT: XrStructureType =
    1000053002;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_FRAME_END_INFO_MSFT:
    XrStructureType = 1000053003;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_LAYER_INFO_MSFT: XrStructureType =
    1000053004;
pub const XrStructureType_XR_TYPE_SECONDARY_VIEW_CONFIGURATION_SWAPCHAIN_CREATE_INFO_MSFT:
    XrStructureType = 1000053005;
pub const XrStructureType_XR_TYPE_CONTROLLER_MODEL_KEY_STATE_MSFT: XrStructureType = 1000055000;
pub const XrStructureType_XR_TYPE_CONTROLLER_MODEL_NODE_PROPERTIES_MSFT: XrStructureType =
    1000055001;
pub const XrStructureType_XR_TYPE_CONTROLLER_MODEL_PROPERTIES_MSFT: XrStructureType = 1000055002;
pub const XrStructureType_XR_TYPE_CONTROLLER_MODEL_NODE_STATE_MSFT: XrStructureType = 1000055003;
pub const XrStructureType_XR_TYPE_CONTROLLER_MODEL_STATE_MSFT: XrStructureType = 1000055004;
pub const XrStructureType_XR_TYPE_VIEW_CONFIGURATION_VIEW_FOV_EPIC: XrStructureType = 1000059000;
pub const XrStructureType_XR_TYPE_HOLOGRAPHIC_WINDOW_ATTACHMENT_MSFT: XrStructureType = 1000063000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_REPROJECTION_INFO_MSFT: XrStructureType =
    1000066000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_REPROJECTION_PLANE_OVERRIDE_MSFT:
    XrStructureType = 1000066001;
pub const XrStructureType_XR_TYPE_ANDROID_SURFACE_SWAPCHAIN_CREATE_INFO_FB: XrStructureType =
    1000070000;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_SECURE_CONTENT_FB: XrStructureType = 1000072000;
pub const XrStructureType_XR_TYPE_BODY_TRACKER_CREATE_INFO_FB: XrStructureType = 1000076001;
pub const XrStructureType_XR_TYPE_BODY_JOINTS_LOCATE_INFO_FB: XrStructureType = 1000076002;
pub const XrStructureType_XR_TYPE_SYSTEM_BODY_TRACKING_PROPERTIES_FB: XrStructureType = 1000076004;
pub const XrStructureType_XR_TYPE_BODY_JOINT_LOCATIONS_FB: XrStructureType = 1000076005;
pub const XrStructureType_XR_TYPE_BODY_SKELETON_FB: XrStructureType = 1000076006;
pub const XrStructureType_XR_TYPE_INTERACTION_PROFILE_DPAD_BINDING_EXT: XrStructureType =
    1000078000;
pub const XrStructureType_XR_TYPE_INTERACTION_PROFILE_ANALOG_THRESHOLD_VALVE: XrStructureType =
    1000079000;
pub const XrStructureType_XR_TYPE_HAND_JOINTS_MOTION_RANGE_INFO_EXT: XrStructureType = 1000080000;
pub const XrStructureType_XR_TYPE_LOADER_INIT_INFO_ANDROID_KHR: XrStructureType = 1000089000;
pub const XrStructureType_XR_TYPE_VULKAN_INSTANCE_CREATE_INFO_KHR: XrStructureType = 1000090000;
pub const XrStructureType_XR_TYPE_VULKAN_DEVICE_CREATE_INFO_KHR: XrStructureType = 1000090001;
pub const XrStructureType_XR_TYPE_VULKAN_GRAPHICS_DEVICE_GET_INFO_KHR: XrStructureType = 1000090003;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_EQUIRECT2_KHR: XrStructureType = 1000091000;
pub const XrStructureType_XR_TYPE_SCENE_OBSERVER_CREATE_INFO_MSFT: XrStructureType = 1000097000;
pub const XrStructureType_XR_TYPE_SCENE_CREATE_INFO_MSFT: XrStructureType = 1000097001;
pub const XrStructureType_XR_TYPE_NEW_SCENE_COMPUTE_INFO_MSFT: XrStructureType = 1000097002;
pub const XrStructureType_XR_TYPE_VISUAL_MESH_COMPUTE_LOD_INFO_MSFT: XrStructureType = 1000097003;
pub const XrStructureType_XR_TYPE_SCENE_COMPONENTS_MSFT: XrStructureType = 1000097004;
pub const XrStructureType_XR_TYPE_SCENE_COMPONENTS_GET_INFO_MSFT: XrStructureType = 1000097005;
pub const XrStructureType_XR_TYPE_SCENE_COMPONENT_LOCATIONS_MSFT: XrStructureType = 1000097006;
pub const XrStructureType_XR_TYPE_SCENE_COMPONENTS_LOCATE_INFO_MSFT: XrStructureType = 1000097007;
pub const XrStructureType_XR_TYPE_SCENE_OBJECTS_MSFT: XrStructureType = 1000097008;
pub const XrStructureType_XR_TYPE_SCENE_COMPONENT_PARENT_FILTER_INFO_MSFT: XrStructureType =
    1000097009;
pub const XrStructureType_XR_TYPE_SCENE_OBJECT_TYPES_FILTER_INFO_MSFT: XrStructureType = 1000097010;
pub const XrStructureType_XR_TYPE_SCENE_PLANES_MSFT: XrStructureType = 1000097011;
pub const XrStructureType_XR_TYPE_SCENE_PLANE_ALIGNMENT_FILTER_INFO_MSFT: XrStructureType =
    1000097012;
pub const XrStructureType_XR_TYPE_SCENE_MESHES_MSFT: XrStructureType = 1000097013;
pub const XrStructureType_XR_TYPE_SCENE_MESH_BUFFERS_GET_INFO_MSFT: XrStructureType = 1000097014;
pub const XrStructureType_XR_TYPE_SCENE_MESH_BUFFERS_MSFT: XrStructureType = 1000097015;
pub const XrStructureType_XR_TYPE_SCENE_MESH_VERTEX_BUFFER_MSFT: XrStructureType = 1000097016;
pub const XrStructureType_XR_TYPE_SCENE_MESH_INDICES_UINT32_MSFT: XrStructureType = 1000097017;
pub const XrStructureType_XR_TYPE_SCENE_MESH_INDICES_UINT16_MSFT: XrStructureType = 1000097018;
pub const XrStructureType_XR_TYPE_SERIALIZED_SCENE_FRAGMENT_DATA_GET_INFO_MSFT: XrStructureType =
    1000098000;
pub const XrStructureType_XR_TYPE_SCENE_DESERIALIZE_INFO_MSFT: XrStructureType = 1000098001;
pub const XrStructureType_XR_TYPE_EVENT_DATA_DISPLAY_REFRESH_RATE_CHANGED_FB: XrStructureType =
    1000101000;
pub const XrStructureType_XR_TYPE_VIVE_TRACKER_PATHS_HTCX: XrStructureType = 1000103000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIVE_TRACKER_CONNECTED_HTCX: XrStructureType =
    1000103001;
pub const XrStructureType_XR_TYPE_SYSTEM_FACIAL_TRACKING_PROPERTIES_HTC: XrStructureType =
    1000104000;
pub const XrStructureType_XR_TYPE_FACIAL_TRACKER_CREATE_INFO_HTC: XrStructureType = 1000104001;
pub const XrStructureType_XR_TYPE_FACIAL_EXPRESSIONS_HTC: XrStructureType = 1000104002;
pub const XrStructureType_XR_TYPE_SYSTEM_COLOR_SPACE_PROPERTIES_FB: XrStructureType = 1000108000;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_MESH_FB: XrStructureType = 1000110001;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_SCALE_FB: XrStructureType = 1000110003;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_AIM_STATE_FB: XrStructureType = 1000111001;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_CAPSULES_STATE_FB: XrStructureType = 1000112000;
pub const XrStructureType_XR_TYPE_SYSTEM_SPATIAL_ENTITY_PROPERTIES_FB: XrStructureType = 1000113004;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_CREATE_INFO_FB: XrStructureType = 1000113003;
pub const XrStructureType_XR_TYPE_SPACE_COMPONENT_STATUS_SET_INFO_FB: XrStructureType = 1000113007;
pub const XrStructureType_XR_TYPE_SPACE_COMPONENT_STATUS_FB: XrStructureType = 1000113001;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPATIAL_ANCHOR_CREATE_COMPLETE_FB: XrStructureType =
    1000113005;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_SET_STATUS_COMPLETE_FB: XrStructureType =
    1000113006;
pub const XrStructureType_XR_TYPE_FOVEATION_PROFILE_CREATE_INFO_FB: XrStructureType = 1000114000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_CREATE_INFO_FOVEATION_FB: XrStructureType = 1000114001;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_STATE_FOVEATION_FB: XrStructureType = 1000114002;
pub const XrStructureType_XR_TYPE_FOVEATION_LEVEL_PROFILE_CREATE_INFO_FB: XrStructureType =
    1000115000;
pub const XrStructureType_XR_TYPE_KEYBOARD_SPACE_CREATE_INFO_FB: XrStructureType = 1000116009;
pub const XrStructureType_XR_TYPE_KEYBOARD_TRACKING_QUERY_FB: XrStructureType = 1000116004;
pub const XrStructureType_XR_TYPE_SYSTEM_KEYBOARD_TRACKING_PROPERTIES_FB: XrStructureType =
    1000116002;
pub const XrStructureType_XR_TYPE_TRIANGLE_MESH_CREATE_INFO_FB: XrStructureType = 1000117001;
pub const XrStructureType_XR_TYPE_SYSTEM_PASSTHROUGH_PROPERTIES_FB: XrStructureType = 1000118000;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_CREATE_INFO_FB: XrStructureType = 1000118001;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_LAYER_CREATE_INFO_FB: XrStructureType = 1000118002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_PASSTHROUGH_FB: XrStructureType = 1000118003;
pub const XrStructureType_XR_TYPE_GEOMETRY_INSTANCE_CREATE_INFO_FB: XrStructureType = 1000118004;
pub const XrStructureType_XR_TYPE_GEOMETRY_INSTANCE_TRANSFORM_FB: XrStructureType = 1000118005;
pub const XrStructureType_XR_TYPE_SYSTEM_PASSTHROUGH_PROPERTIES2_FB: XrStructureType = 1000118006;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_STYLE_FB: XrStructureType = 1000118020;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_MAP_MONO_TO_RGBA_FB: XrStructureType =
    1000118021;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_MAP_MONO_TO_MONO_FB: XrStructureType =
    1000118022;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_BRIGHTNESS_CONTRAST_SATURATION_FB: XrStructureType =
    1000118023;
pub const XrStructureType_XR_TYPE_EVENT_DATA_PASSTHROUGH_STATE_CHANGED_FB: XrStructureType =
    1000118030;
pub const XrStructureType_XR_TYPE_RENDER_MODEL_PATH_INFO_FB: XrStructureType = 1000119000;
pub const XrStructureType_XR_TYPE_RENDER_MODEL_PROPERTIES_FB: XrStructureType = 1000119001;
pub const XrStructureType_XR_TYPE_RENDER_MODEL_BUFFER_FB: XrStructureType = 1000119002;
pub const XrStructureType_XR_TYPE_RENDER_MODEL_LOAD_INFO_FB: XrStructureType = 1000119003;
pub const XrStructureType_XR_TYPE_SYSTEM_RENDER_MODEL_PROPERTIES_FB: XrStructureType = 1000119004;
pub const XrStructureType_XR_TYPE_RENDER_MODEL_CAPABILITIES_REQUEST_FB: XrStructureType =
    1000119005;
pub const XrStructureType_XR_TYPE_BINDING_MODIFICATIONS_KHR: XrStructureType = 1000120000;
pub const XrStructureType_XR_TYPE_VIEW_LOCATE_FOVEATED_RENDERING_VARJO: XrStructureType =
    1000121000;
pub const XrStructureType_XR_TYPE_FOVEATED_VIEW_CONFIGURATION_VIEW_VARJO: XrStructureType =
    1000121001;
pub const XrStructureType_XR_TYPE_SYSTEM_FOVEATED_RENDERING_PROPERTIES_VARJO: XrStructureType =
    1000121002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_DEPTH_TEST_VARJO: XrStructureType = 1000122000;
pub const XrStructureType_XR_TYPE_SYSTEM_MARKER_TRACKING_PROPERTIES_VARJO: XrStructureType =
    1000124000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_MARKER_TRACKING_UPDATE_VARJO: XrStructureType =
    1000124001;
pub const XrStructureType_XR_TYPE_MARKER_SPACE_CREATE_INFO_VARJO: XrStructureType = 1000124002;
pub const XrStructureType_XR_TYPE_FRAME_END_INFO_ML: XrStructureType = 1000135000;
pub const XrStructureType_XR_TYPE_GLOBAL_DIMMER_FRAME_END_INFO_ML: XrStructureType = 1000136000;
pub const XrStructureType_XR_TYPE_COORDINATE_SPACE_CREATE_INFO_ML: XrStructureType = 1000137000;
pub const XrStructureType_XR_TYPE_SYSTEM_MARKER_UNDERSTANDING_PROPERTIES_ML: XrStructureType =
    1000138000;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_CREATE_INFO_ML: XrStructureType = 1000138001;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_ARUCO_INFO_ML: XrStructureType = 1000138002;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_SIZE_INFO_ML: XrStructureType = 1000138003;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_APRIL_TAG_INFO_ML: XrStructureType = 1000138004;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_CUSTOM_PROFILE_INFO_ML: XrStructureType =
    1000138005;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_SNAPSHOT_INFO_ML: XrStructureType = 1000138006;
pub const XrStructureType_XR_TYPE_MARKER_DETECTOR_STATE_ML: XrStructureType = 1000138007;
pub const XrStructureType_XR_TYPE_MARKER_SPACE_CREATE_INFO_ML: XrStructureType = 1000138008;
pub const XrStructureType_XR_TYPE_LOCALIZATION_MAP_ML: XrStructureType = 1000139000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_LOCALIZATION_CHANGED_ML: XrStructureType = 1000139001;
pub const XrStructureType_XR_TYPE_MAP_LOCALIZATION_REQUEST_INFO_ML: XrStructureType = 1000139002;
pub const XrStructureType_XR_TYPE_LOCALIZATION_MAP_IMPORT_INFO_ML: XrStructureType = 1000139003;
pub const XrStructureType_XR_TYPE_LOCALIZATION_ENABLE_EVENTS_INFO_ML: XrStructureType = 1000139004;
pub const XrStructureType_XR_TYPE_EVENT_DATA_HEADSET_FIT_CHANGED_ML: XrStructureType = 1000472000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_EYE_CALIBRATION_CHANGED_ML: XrStructureType =
    1000472001;
pub const XrStructureType_XR_TYPE_USER_CALIBRATION_ENABLE_EVENTS_INFO_ML: XrStructureType =
    1000472002;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_PERSISTENCE_INFO_MSFT: XrStructureType =
    1000142000;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_FROM_PERSISTED_ANCHOR_CREATE_INFO_MSFT:
    XrStructureType = 1000142001;
pub const XrStructureType_XR_TYPE_SCENE_MARKERS_MSFT: XrStructureType = 1000147000;
pub const XrStructureType_XR_TYPE_SCENE_MARKER_TYPE_FILTER_MSFT: XrStructureType = 1000147001;
pub const XrStructureType_XR_TYPE_SCENE_MARKER_QR_CODES_MSFT: XrStructureType = 1000147002;
pub const XrStructureType_XR_TYPE_SPACE_QUERY_INFO_FB: XrStructureType = 1000156001;
pub const XrStructureType_XR_TYPE_SPACE_QUERY_RESULTS_FB: XrStructureType = 1000156002;
pub const XrStructureType_XR_TYPE_SPACE_STORAGE_LOCATION_FILTER_INFO_FB: XrStructureType =
    1000156003;
pub const XrStructureType_XR_TYPE_SPACE_UUID_FILTER_INFO_FB: XrStructureType = 1000156054;
pub const XrStructureType_XR_TYPE_SPACE_COMPONENT_FILTER_INFO_FB: XrStructureType = 1000156052;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_QUERY_RESULTS_AVAILABLE_FB: XrStructureType =
    1000156103;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_QUERY_COMPLETE_FB: XrStructureType = 1000156104;
pub const XrStructureType_XR_TYPE_SPACE_SAVE_INFO_FB: XrStructureType = 1000158000;
pub const XrStructureType_XR_TYPE_SPACE_ERASE_INFO_FB: XrStructureType = 1000158001;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_SAVE_COMPLETE_FB: XrStructureType = 1000158106;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_ERASE_COMPLETE_FB: XrStructureType = 1000158107;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_FOVEATION_VULKAN_FB: XrStructureType = 1000160000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_STATE_ANDROID_SURFACE_DIMENSIONS_FB: XrStructureType =
    1000161000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_STATE_SAMPLER_OPENGL_ES_FB: XrStructureType =
    1000162000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_STATE_SAMPLER_VULKAN_FB: XrStructureType = 1000163000;
pub const XrStructureType_XR_TYPE_SPACE_SHARE_INFO_FB: XrStructureType = 1000169001;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_SHARE_COMPLETE_FB: XrStructureType = 1000169002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_SPACE_WARP_INFO_FB: XrStructureType =
    1000171000;
pub const XrStructureType_XR_TYPE_SYSTEM_SPACE_WARP_PROPERTIES_FB: XrStructureType = 1000171001;
pub const XrStructureType_XR_TYPE_HAPTIC_AMPLITUDE_ENVELOPE_VIBRATION_FB: XrStructureType =
    1000173001;
pub const XrStructureType_XR_TYPE_SEMANTIC_LABELS_FB: XrStructureType = 1000175000;
pub const XrStructureType_XR_TYPE_ROOM_LAYOUT_FB: XrStructureType = 1000175001;
pub const XrStructureType_XR_TYPE_BOUNDARY_2D_FB: XrStructureType = 1000175002;
pub const XrStructureType_XR_TYPE_SEMANTIC_LABELS_SUPPORT_INFO_FB: XrStructureType = 1000175010;
pub const XrStructureType_XR_TYPE_DIGITAL_LENS_CONTROL_ALMALENCE: XrStructureType = 1000196000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SCENE_CAPTURE_COMPLETE_FB: XrStructureType =
    1000198001;
pub const XrStructureType_XR_TYPE_SCENE_CAPTURE_REQUEST_INFO_FB: XrStructureType = 1000198050;
pub const XrStructureType_XR_TYPE_SPACE_CONTAINER_FB: XrStructureType = 1000199000;
pub const XrStructureType_XR_TYPE_FOVEATION_EYE_TRACKED_PROFILE_CREATE_INFO_META: XrStructureType =
    1000200000;
pub const XrStructureType_XR_TYPE_FOVEATION_EYE_TRACKED_STATE_META: XrStructureType = 1000200001;
pub const XrStructureType_XR_TYPE_SYSTEM_FOVEATION_EYE_TRACKED_PROPERTIES_META: XrStructureType =
    1000200002;
pub const XrStructureType_XR_TYPE_SYSTEM_FACE_TRACKING_PROPERTIES_FB: XrStructureType = 1000201004;
pub const XrStructureType_XR_TYPE_FACE_TRACKER_CREATE_INFO_FB: XrStructureType = 1000201005;
pub const XrStructureType_XR_TYPE_FACE_EXPRESSION_INFO_FB: XrStructureType = 1000201002;
pub const XrStructureType_XR_TYPE_FACE_EXPRESSION_WEIGHTS_FB: XrStructureType = 1000201006;
pub const XrStructureType_XR_TYPE_EYE_TRACKER_CREATE_INFO_FB: XrStructureType = 1000202001;
pub const XrStructureType_XR_TYPE_EYE_GAZES_INFO_FB: XrStructureType = 1000202002;
pub const XrStructureType_XR_TYPE_EYE_GAZES_FB: XrStructureType = 1000202003;
pub const XrStructureType_XR_TYPE_SYSTEM_EYE_TRACKING_PROPERTIES_FB: XrStructureType = 1000202004;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_KEYBOARD_HANDS_INTENSITY_FB: XrStructureType =
    1000203002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_SETTINGS_FB: XrStructureType = 1000204000;
pub const XrStructureType_XR_TYPE_HAPTIC_PCM_VIBRATION_FB: XrStructureType = 1000209001;
pub const XrStructureType_XR_TYPE_DEVICE_PCM_SAMPLE_RATE_STATE_FB: XrStructureType = 1000209002;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_DEPTH_TEST_FB: XrStructureType = 1000212000;
pub const XrStructureType_XR_TYPE_LOCAL_DIMMING_FRAME_END_INFO_META: XrStructureType = 1000216000;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_PREFERENCES_META: XrStructureType = 1000217000;
pub const XrStructureType_XR_TYPE_SYSTEM_VIRTUAL_KEYBOARD_PROPERTIES_META: XrStructureType =
    1000219001;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_CREATE_INFO_META: XrStructureType = 1000219002;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_SPACE_CREATE_INFO_META: XrStructureType =
    1000219003;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_LOCATION_INFO_META: XrStructureType = 1000219004;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_MODEL_VISIBILITY_SET_INFO_META: XrStructureType =
    1000219005;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_ANIMATION_STATE_META: XrStructureType =
    1000219006;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_MODEL_ANIMATION_STATES_META: XrStructureType =
    1000219007;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_TEXTURE_DATA_META: XrStructureType = 1000219009;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_INPUT_INFO_META: XrStructureType = 1000219010;
pub const XrStructureType_XR_TYPE_VIRTUAL_KEYBOARD_TEXT_CONTEXT_CHANGE_INFO_META: XrStructureType =
    1000219011;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIRTUAL_KEYBOARD_COMMIT_TEXT_META: XrStructureType =
    1000219014;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIRTUAL_KEYBOARD_BACKSPACE_META: XrStructureType =
    1000219015;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIRTUAL_KEYBOARD_ENTER_META: XrStructureType =
    1000219016;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIRTUAL_KEYBOARD_SHOWN_META: XrStructureType =
    1000219017;
pub const XrStructureType_XR_TYPE_EVENT_DATA_VIRTUAL_KEYBOARD_HIDDEN_META: XrStructureType =
    1000219018;
pub const XrStructureType_XR_TYPE_EXTERNAL_CAMERA_OCULUS: XrStructureType = 1000226000;
pub const XrStructureType_XR_TYPE_VULKAN_SWAPCHAIN_CREATE_INFO_META: XrStructureType = 1000227000;
pub const XrStructureType_XR_TYPE_PERFORMANCE_METRICS_STATE_META: XrStructureType = 1000232001;
pub const XrStructureType_XR_TYPE_PERFORMANCE_METRICS_COUNTER_META: XrStructureType = 1000232002;
pub const XrStructureType_XR_TYPE_SPACE_LIST_SAVE_INFO_FB: XrStructureType = 1000238000;
pub const XrStructureType_XR_TYPE_EVENT_DATA_SPACE_LIST_SAVE_COMPLETE_FB: XrStructureType =
    1000238001;
pub const XrStructureType_XR_TYPE_SPACE_USER_CREATE_INFO_FB: XrStructureType = 1000241001;
pub const XrStructureType_XR_TYPE_SYSTEM_HEADSET_ID_PROPERTIES_META: XrStructureType = 1000245000;
pub const XrStructureType_XR_TYPE_RECOMMENDED_LAYER_RESOLUTION_META: XrStructureType = 1000254000;
pub const XrStructureType_XR_TYPE_RECOMMENDED_LAYER_RESOLUTION_GET_INFO_META: XrStructureType =
    1000254001;
pub const XrStructureType_XR_TYPE_SYSTEM_PASSTHROUGH_COLOR_LUT_PROPERTIES_META: XrStructureType =
    1000266000;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_LUT_CREATE_INFO_META: XrStructureType =
    1000266001;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_LUT_UPDATE_INFO_META: XrStructureType =
    1000266002;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_MAP_LUT_META: XrStructureType = 1000266100;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_MAP_INTERPOLATED_LUT_META: XrStructureType =
    1000266101;
pub const XrStructureType_XR_TYPE_SPACE_TRIANGLE_MESH_GET_INFO_META: XrStructureType = 1000269001;
pub const XrStructureType_XR_TYPE_SPACE_TRIANGLE_MESH_META: XrStructureType = 1000269002;
pub const XrStructureType_XR_TYPE_SYSTEM_FACE_TRACKING_PROPERTIES2_FB: XrStructureType = 1000287013;
pub const XrStructureType_XR_TYPE_FACE_TRACKER_CREATE_INFO2_FB: XrStructureType = 1000287014;
pub const XrStructureType_XR_TYPE_FACE_EXPRESSION_INFO2_FB: XrStructureType = 1000287015;
pub const XrStructureType_XR_TYPE_FACE_EXPRESSION_WEIGHTS2_FB: XrStructureType = 1000287016;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_PROVIDER_CREATE_INFO_META: XrStructureType =
    1000291000;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_SWAPCHAIN_CREATE_INFO_META: XrStructureType =
    1000291001;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_SWAPCHAIN_STATE_META: XrStructureType =
    1000291002;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_IMAGE_ACQUIRE_INFO_META: XrStructureType =
    1000291003;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_IMAGE_VIEW_META: XrStructureType = 1000291004;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_IMAGE_META: XrStructureType = 1000291005;
pub const XrStructureType_XR_TYPE_ENVIRONMENT_DEPTH_HAND_REMOVAL_SET_INFO_META: XrStructureType =
    1000291006;
pub const XrStructureType_XR_TYPE_SYSTEM_ENVIRONMENT_DEPTH_PROPERTIES_META: XrStructureType =
    1000291007;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_CREATE_INFO_HTC: XrStructureType = 1000317001;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_COLOR_HTC: XrStructureType = 1000317002;
pub const XrStructureType_XR_TYPE_PASSTHROUGH_MESH_TRANSFORM_INFO_HTC: XrStructureType = 1000317003;
pub const XrStructureType_XR_TYPE_COMPOSITION_LAYER_PASSTHROUGH_HTC: XrStructureType = 1000317004;
pub const XrStructureType_XR_TYPE_FOVEATION_APPLY_INFO_HTC: XrStructureType = 1000318000;
pub const XrStructureType_XR_TYPE_FOVEATION_DYNAMIC_MODE_INFO_HTC: XrStructureType = 1000318001;
pub const XrStructureType_XR_TYPE_FOVEATION_CUSTOM_MODE_INFO_HTC: XrStructureType = 1000318002;
pub const XrStructureType_XR_TYPE_SYSTEM_ANCHOR_PROPERTIES_HTC: XrStructureType = 1000319000;
pub const XrStructureType_XR_TYPE_SPATIAL_ANCHOR_CREATE_INFO_HTC: XrStructureType = 1000319001;
pub const XrStructureType_XR_TYPE_ACTIVE_ACTION_SET_PRIORITIES_EXT: XrStructureType = 1000373000;
pub const XrStructureType_XR_TYPE_SYSTEM_FORCE_FEEDBACK_CURL_PROPERTIES_MNDX: XrStructureType =
    1000375000;
pub const XrStructureType_XR_TYPE_FORCE_FEEDBACK_CURL_APPLY_LOCATIONS_MNDX: XrStructureType =
    1000375001;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_DATA_SOURCE_INFO_EXT: XrStructureType = 1000428000;
pub const XrStructureType_XR_TYPE_HAND_TRACKING_DATA_SOURCE_STATE_EXT: XrStructureType = 1000428001;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_CREATE_INFO_EXT: XrStructureType = 1000429001;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_BEGIN_INFO_EXT: XrStructureType = 1000429002;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_GET_INFO_EXT: XrStructureType = 1000429003;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_LOCATIONS_EXT: XrStructureType = 1000429004;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_LOCATION_EXT: XrStructureType = 1000429005;
pub const XrStructureType_XR_TYPE_PLANE_DETECTOR_POLYGON_BUFFER_EXT: XrStructureType = 1000429006;
pub const XrStructureType_XR_TYPE_SYSTEM_PLANE_DETECTION_PROPERTIES_EXT: XrStructureType =
    1000429007;
pub const XrStructureType_XR_TYPE_FUTURE_CANCEL_INFO_EXT: XrStructureType = 1000469000;
pub const XrStructureType_XR_TYPE_FUTURE_POLL_INFO_EXT: XrStructureType = 1000469001;
pub const XrStructureType_XR_TYPE_FUTURE_COMPLETION_EXT: XrStructureType = 1000469002;
pub const XrStructureType_XR_TYPE_FUTURE_POLL_RESULT_EXT: XrStructureType = 1000469003;
pub const XrStructureType_XR_TYPE_EVENT_DATA_USER_PRESENCE_CHANGED_EXT: XrStructureType =
    1000470000;
pub const XrStructureType_XR_TYPE_SYSTEM_USER_PRESENCE_PROPERTIES_EXT: XrStructureType = 1000470001;
pub const XrStructureType_XR_TYPE_GRAPHICS_BINDING_VULKAN2_KHR: XrStructureType = 1000025000;
pub const XrStructureType_XR_TYPE_SWAPCHAIN_IMAGE_VULKAN2_KHR: XrStructureType = 1000025001;
pub const XrStructureType_XR_TYPE_GRAPHICS_REQUIREMENTS_VULKAN2_KHR: XrStructureType = 1000025002;
pub const XrStructureType_XR_TYPE_DEVICE_PCM_SAMPLE_RATE_GET_INFO_FB: XrStructureType = 1000209002;
pub const XrStructureType_XR_TYPE_SPACES_LOCATE_INFO_KHR: XrStructureType = 1000471000;
pub const XrStructureType_XR_TYPE_SPACE_LOCATIONS_KHR: XrStructureType = 1000471001;
pub const XrStructureType_XR_TYPE_SPACE_VELOCITIES_KHR: XrStructureType = 1000471002;
pub const XrStructureType_XR_STRUCTURE_TYPE_MAX_ENUM: XrStructureType = 2147483647;
pub type XrStructureType = ::std::os::raw::c_int;
pub const XrFormFactor_XR_FORM_FACTOR_HEAD_MOUNTED_DISPLAY: XrFormFactor = 1;
pub const XrFormFactor_XR_FORM_FACTOR_HANDHELD_DISPLAY: XrFormFactor = 2;
pub const XrFormFactor_XR_FORM_FACTOR_MAX_ENUM: XrFormFactor = 2147483647;
pub type XrFormFactor = ::std::os::raw::c_int;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_PRIMARY_MONO: XrViewConfigurationType =
    1;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_PRIMARY_STEREO:
    XrViewConfigurationType = 2;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_PRIMARY_STEREO_WITH_FOVEATED_INSET:
    XrViewConfigurationType = 1000037000;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_SECONDARY_MONO_FIRST_PERSON_OBSERVER_MSFT : XrViewConfigurationType = 1000054000 ;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_PRIMARY_QUAD_VARJO:
    XrViewConfigurationType = 1000037000;
pub const XrViewConfigurationType_XR_VIEW_CONFIGURATION_TYPE_MAX_ENUM: XrViewConfigurationType =
    2147483647;
pub type XrViewConfigurationType = ::std::os::raw::c_int;
pub const XrEnvironmentBlendMode_XR_ENVIRONMENT_BLEND_MODE_OPAQUE: XrEnvironmentBlendMode = 1;
pub const XrEnvironmentBlendMode_XR_ENVIRONMENT_BLEND_MODE_ADDITIVE: XrEnvironmentBlendMode = 2;
pub const XrEnvironmentBlendMode_XR_ENVIRONMENT_BLEND_MODE_ALPHA_BLEND: XrEnvironmentBlendMode = 3;
pub const XrEnvironmentBlendMode_XR_ENVIRONMENT_BLEND_MODE_MAX_ENUM: XrEnvironmentBlendMode =
    2147483647;
pub type XrEnvironmentBlendMode = ::std::os::raw::c_int;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_VIEW: XrReferenceSpaceType = 1;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_LOCAL: XrReferenceSpaceType = 2;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_STAGE: XrReferenceSpaceType = 3;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_LOCAL_FLOOR: XrReferenceSpaceType =
    1000426000;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_UNBOUNDED_MSFT: XrReferenceSpaceType =
    1000038000;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_COMBINED_EYE_VARJO: XrReferenceSpaceType =
    1000121000;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_LOCALIZATION_MAP_ML: XrReferenceSpaceType =
    1000139000;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_LOCAL_FLOOR_EXT: XrReferenceSpaceType =
    1000426000;
pub const XrReferenceSpaceType_XR_REFERENCE_SPACE_TYPE_MAX_ENUM: XrReferenceSpaceType = 2147483647;
pub type XrReferenceSpaceType = ::std::os::raw::c_int;
pub const XrActionType_XR_ACTION_TYPE_BOOLEAN_INPUT: XrActionType = 1;
pub const XrActionType_XR_ACTION_TYPE_FLOAT_INPUT: XrActionType = 2;
pub const XrActionType_XR_ACTION_TYPE_VECTOR2F_INPUT: XrActionType = 3;
pub const XrActionType_XR_ACTION_TYPE_POSE_INPUT: XrActionType = 4;
pub const XrActionType_XR_ACTION_TYPE_VIBRATION_OUTPUT: XrActionType = 100;
pub const XrActionType_XR_ACTION_TYPE_MAX_ENUM: XrActionType = 2147483647;
pub type XrActionType = ::std::os::raw::c_int;
pub const XrEyeVisibility_XR_EYE_VISIBILITY_BOTH: XrEyeVisibility = 0;
pub const XrEyeVisibility_XR_EYE_VISIBILITY_LEFT: XrEyeVisibility = 1;
pub const XrEyeVisibility_XR_EYE_VISIBILITY_RIGHT: XrEyeVisibility = 2;
pub const XrEyeVisibility_XR_EYE_VISIBILITY_MAX_ENUM: XrEyeVisibility = 2147483647;
pub type XrEyeVisibility = ::std::os::raw::c_int;
pub const XrSessionState_XR_SESSION_STATE_UNKNOWN: XrSessionState = 0;
pub const XrSessionState_XR_SESSION_STATE_IDLE: XrSessionState = 1;
pub const XrSessionState_XR_SESSION_STATE_READY: XrSessionState = 2;
pub const XrSessionState_XR_SESSION_STATE_SYNCHRONIZED: XrSessionState = 3;
pub const XrSessionState_XR_SESSION_STATE_VISIBLE: XrSessionState = 4;
pub const XrSessionState_XR_SESSION_STATE_FOCUSED: XrSessionState = 5;
pub const XrSessionState_XR_SESSION_STATE_STOPPING: XrSessionState = 6;
pub const XrSessionState_XR_SESSION_STATE_LOSS_PENDING: XrSessionState = 7;
pub const XrSessionState_XR_SESSION_STATE_EXITING: XrSessionState = 8;
pub const XrSessionState_XR_SESSION_STATE_MAX_ENUM: XrSessionState = 2147483647;
pub type XrSessionState = ::std::os::raw::c_int;
pub const XrObjectType_XR_OBJECT_TYPE_UNKNOWN: XrObjectType = 0;
pub const XrObjectType_XR_OBJECT_TYPE_INSTANCE: XrObjectType = 1;
pub const XrObjectType_XR_OBJECT_TYPE_SESSION: XrObjectType = 2;
pub const XrObjectType_XR_OBJECT_TYPE_SWAPCHAIN: XrObjectType = 3;
pub const XrObjectType_XR_OBJECT_TYPE_SPACE: XrObjectType = 4;
pub const XrObjectType_XR_OBJECT_TYPE_ACTION_SET: XrObjectType = 5;
pub const XrObjectType_XR_OBJECT_TYPE_ACTION: XrObjectType = 6;
pub const XrObjectType_XR_OBJECT_TYPE_DEBUG_UTILS_MESSENGER_EXT: XrObjectType = 1000019000;
pub const XrObjectType_XR_OBJECT_TYPE_SPATIAL_ANCHOR_MSFT: XrObjectType = 1000039000;
pub const XrObjectType_XR_OBJECT_TYPE_SPATIAL_GRAPH_NODE_BINDING_MSFT: XrObjectType = 1000049000;
pub const XrObjectType_XR_OBJECT_TYPE_HAND_TRACKER_EXT: XrObjectType = 1000051000;
pub const XrObjectType_XR_OBJECT_TYPE_BODY_TRACKER_FB: XrObjectType = 1000076000;
pub const XrObjectType_XR_OBJECT_TYPE_SCENE_OBSERVER_MSFT: XrObjectType = 1000097000;
pub const XrObjectType_XR_OBJECT_TYPE_SCENE_MSFT: XrObjectType = 1000097001;
pub const XrObjectType_XR_OBJECT_TYPE_FACIAL_TRACKER_HTC: XrObjectType = 1000104000;
pub const XrObjectType_XR_OBJECT_TYPE_FOVEATION_PROFILE_FB: XrObjectType = 1000114000;
pub const XrObjectType_XR_OBJECT_TYPE_TRIANGLE_MESH_FB: XrObjectType = 1000117000;
pub const XrObjectType_XR_OBJECT_TYPE_PASSTHROUGH_FB: XrObjectType = 1000118000;
pub const XrObjectType_XR_OBJECT_TYPE_PASSTHROUGH_LAYER_FB: XrObjectType = 1000118002;
pub const XrObjectType_XR_OBJECT_TYPE_GEOMETRY_INSTANCE_FB: XrObjectType = 1000118004;
pub const XrObjectType_XR_OBJECT_TYPE_MARKER_DETECTOR_ML: XrObjectType = 1000138000;
pub const XrObjectType_XR_OBJECT_TYPE_EXPORTED_LOCALIZATION_MAP_ML: XrObjectType = 1000139000;
pub const XrObjectType_XR_OBJECT_TYPE_SPATIAL_ANCHOR_STORE_CONNECTION_MSFT: XrObjectType =
    1000142000;
pub const XrObjectType_XR_OBJECT_TYPE_FACE_TRACKER_FB: XrObjectType = 1000201000;
pub const XrObjectType_XR_OBJECT_TYPE_EYE_TRACKER_FB: XrObjectType = 1000202000;
pub const XrObjectType_XR_OBJECT_TYPE_VIRTUAL_KEYBOARD_META: XrObjectType = 1000219000;
pub const XrObjectType_XR_OBJECT_TYPE_SPACE_USER_FB: XrObjectType = 1000241000;
pub const XrObjectType_XR_OBJECT_TYPE_PASSTHROUGH_COLOR_LUT_META: XrObjectType = 1000266000;
pub const XrObjectType_XR_OBJECT_TYPE_FACE_TRACKER2_FB: XrObjectType = 1000287012;
pub const XrObjectType_XR_OBJECT_TYPE_ENVIRONMENT_DEPTH_PROVIDER_META: XrObjectType = 1000291000;
pub const XrObjectType_XR_OBJECT_TYPE_ENVIRONMENT_DEPTH_SWAPCHAIN_META: XrObjectType = 1000291001;
pub const XrObjectType_XR_OBJECT_TYPE_PASSTHROUGH_HTC: XrObjectType = 1000317000;
pub const XrObjectType_XR_OBJECT_TYPE_PLANE_DETECTOR_EXT: XrObjectType = 1000429000;
pub const XrObjectType_XR_OBJECT_TYPE_MAX_ENUM: XrObjectType = 2147483647;
pub type XrObjectType = ::std::os::raw::c_int;
pub type XrInstanceCreateFlags = XrFlags64;
pub type XrSessionCreateFlags = XrFlags64;
pub type XrSpaceVelocityFlags = XrFlags64;
pub const XR_SPACE_VELOCITY_LINEAR_VALID_BIT: XrSpaceVelocityFlags = 1;
pub const XR_SPACE_VELOCITY_ANGULAR_VALID_BIT: XrSpaceVelocityFlags = 2;
pub type XrSpaceLocationFlags = XrFlags64;
pub const XR_SPACE_LOCATION_ORIENTATION_VALID_BIT: XrSpaceLocationFlags = 1;
pub const XR_SPACE_LOCATION_POSITION_VALID_BIT: XrSpaceLocationFlags = 2;
pub const XR_SPACE_LOCATION_ORIENTATION_TRACKED_BIT: XrSpaceLocationFlags = 4;
pub const XR_SPACE_LOCATION_POSITION_TRACKED_BIT: XrSpaceLocationFlags = 8;
pub type XrSwapchainCreateFlags = XrFlags64;
pub const XR_SWAPCHAIN_CREATE_PROTECTED_CONTENT_BIT: XrSwapchainCreateFlags = 1;
pub const XR_SWAPCHAIN_CREATE_STATIC_IMAGE_BIT: XrSwapchainCreateFlags = 2;
pub type XrSwapchainUsageFlags = XrFlags64;
pub const XR_SWAPCHAIN_USAGE_COLOR_ATTACHMENT_BIT: XrSwapchainUsageFlags = 1;
pub const XR_SWAPCHAIN_USAGE_DEPTH_STENCIL_ATTACHMENT_BIT: XrSwapchainUsageFlags = 2;
pub const XR_SWAPCHAIN_USAGE_UNORDERED_ACCESS_BIT: XrSwapchainUsageFlags = 4;
pub const XR_SWAPCHAIN_USAGE_TRANSFER_SRC_BIT: XrSwapchainUsageFlags = 8;
pub const XR_SWAPCHAIN_USAGE_TRANSFER_DST_BIT: XrSwapchainUsageFlags = 16;
pub const XR_SWAPCHAIN_USAGE_SAMPLED_BIT: XrSwapchainUsageFlags = 32;
pub const XR_SWAPCHAIN_USAGE_MUTABLE_FORMAT_BIT: XrSwapchainUsageFlags = 64;
pub const XR_SWAPCHAIN_USAGE_INPUT_ATTACHMENT_BIT_MND: XrSwapchainUsageFlags = 128;
pub const XR_SWAPCHAIN_USAGE_INPUT_ATTACHMENT_BIT_KHR: XrSwapchainUsageFlags = 128;
pub type XrCompositionLayerFlags = XrFlags64;
pub const XR_COMPOSITION_LAYER_CORRECT_CHROMATIC_ABERRATION_BIT: XrCompositionLayerFlags = 1;
pub const XR_COMPOSITION_LAYER_BLEND_TEXTURE_SOURCE_ALPHA_BIT: XrCompositionLayerFlags = 2;
pub const XR_COMPOSITION_LAYER_UNPREMULTIPLIED_ALPHA_BIT: XrCompositionLayerFlags = 4;
pub type XrViewStateFlags = XrFlags64;
pub const XR_VIEW_STATE_ORIENTATION_VALID_BIT: XrViewStateFlags = 1;
pub const XR_VIEW_STATE_POSITION_VALID_BIT: XrViewStateFlags = 2;
pub const XR_VIEW_STATE_ORIENTATION_TRACKED_BIT: XrViewStateFlags = 4;
pub const XR_VIEW_STATE_POSITION_TRACKED_BIT: XrViewStateFlags = 8;
pub type XrInputSourceLocalizedNameFlags = XrFlags64;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_USER_PATH_BIT: XrInputSourceLocalizedNameFlags = 1;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_INTERACTION_PROFILE_BIT: XrInputSourceLocalizedNameFlags =
    2;
pub const XR_INPUT_SOURCE_LOCALIZED_NAME_COMPONENT_BIT: XrInputSourceLocalizedNameFlags = 4;
pub type PFN_xrVoidFunction = ::std::option::Option<unsafe extern "C" fn()>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrApiLayerProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub layerName: [::std::os::raw::c_char; 256usize],
    pub specVersion: XrVersion,
    pub layerVersion: u32,
    pub description: [::std::os::raw::c_char; 256usize],
}
#[test]
fn bindgen_test_layout_XrApiLayerProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrApiLayerProperties> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrApiLayerProperties>(),
        544usize,
        concat!("Size of: ", stringify!(XrApiLayerProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrApiLayerProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(XrApiLayerProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(layerName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).specVersion) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(specVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerVersion) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(layerVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApiLayerProperties),
            "::",
            stringify!(description)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtensionProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub extensionName: [::std::os::raw::c_char; 128usize],
    pub extensionVersion: u32,
}
#[test]
fn bindgen_test_layout_XrExtensionProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrExtensionProperties> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrExtensionProperties>(),
        152usize,
        concat!("Size of: ", stringify!(XrExtensionProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrExtensionProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(XrExtensionProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtensionProperties),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtensionProperties),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extensionName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtensionProperties),
            "::",
            stringify!(extensionName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extensionVersion) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtensionProperties),
            "::",
            stringify!(extensionVersion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrApplicationInfo {
    pub applicationName: [::std::os::raw::c_char; 128usize],
    pub applicationVersion: u32,
    pub engineName: [::std::os::raw::c_char; 128usize],
    pub engineVersion: u32,
    pub apiVersion: XrVersion,
}
#[test]
fn bindgen_test_layout_XrApplicationInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrApplicationInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrApplicationInfo>(),
        272usize,
        concat!("Size of: ", stringify!(XrApplicationInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrApplicationInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrApplicationInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).applicationName) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApplicationInfo),
            "::",
            stringify!(applicationName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).applicationVersion) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApplicationInfo),
            "::",
            stringify!(applicationVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).engineName) as usize - ptr as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApplicationInfo),
            "::",
            stringify!(engineName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).engineVersion) as usize - ptr as usize },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApplicationInfo),
            "::",
            stringify!(engineVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).apiVersion) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(XrApplicationInfo),
            "::",
            stringify!(apiVersion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInstanceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrInstanceCreateFlags,
    pub applicationInfo: XrApplicationInfo,
    pub enabledApiLayerCount: u32,
    pub enabledApiLayerNames: *const *const ::std::os::raw::c_char,
    pub enabledExtensionCount: u32,
    pub enabledExtensionNames: *const *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_XrInstanceCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrInstanceCreateInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrInstanceCreateInfo>(),
        328usize,
        concat!("Size of: ", stringify!(XrInstanceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrInstanceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrInstanceCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(createFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).applicationInfo) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(applicationInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabledApiLayerCount) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(enabledApiLayerCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabledApiLayerNames) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(enabledApiLayerNames)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabledExtensionCount) as usize - ptr as usize },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(enabledExtensionCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).enabledExtensionNames) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceCreateInfo),
            "::",
            stringify!(enabledExtensionNames)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInstanceProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub runtimeVersion: XrVersion,
    pub runtimeName: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_XrInstanceProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrInstanceProperties> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrInstanceProperties>(),
        152usize,
        concat!("Size of: ", stringify!(XrInstanceProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrInstanceProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(XrInstanceProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceProperties),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceProperties),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runtimeVersion) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceProperties),
            "::",
            stringify!(runtimeVersion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).runtimeName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInstanceProperties),
            "::",
            stringify!(runtimeName)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataBuffer {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub varying: [u8; 4000usize],
}
#[test]
fn bindgen_test_layout_XrEventDataBuffer() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataBuffer> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataBuffer>(),
        4016usize,
        concat!("Size of: ", stringify!(XrEventDataBuffer))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataBuffer>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataBuffer))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataBuffer),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataBuffer),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).varying) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataBuffer),
            "::",
            stringify!(varying)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub formFactor: XrFormFactor,
}
#[test]
fn bindgen_test_layout_XrSystemGetInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSystemGetInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSystemGetInfo>(),
        24usize,
        concat!("Size of: ", stringify!(XrSystemGetInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSystemGetInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSystemGetInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGetInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGetInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).formFactor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGetInfo),
            "::",
            stringify!(formFactor)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemGraphicsProperties {
    pub maxSwapchainImageHeight: u32,
    pub maxSwapchainImageWidth: u32,
    pub maxLayerCount: u32,
}
#[test]
fn bindgen_test_layout_XrSystemGraphicsProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrSystemGraphicsProperties> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSystemGraphicsProperties>(),
        12usize,
        concat!("Size of: ", stringify!(XrSystemGraphicsProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSystemGraphicsProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(XrSystemGraphicsProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSwapchainImageHeight) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGraphicsProperties),
            "::",
            stringify!(maxSwapchainImageHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSwapchainImageWidth) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGraphicsProperties),
            "::",
            stringify!(maxSwapchainImageWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxLayerCount) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemGraphicsProperties),
            "::",
            stringify!(maxLayerCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemTrackingProperties {
    pub orientationTracking: XrBool32,
    pub positionTracking: XrBool32,
}
#[test]
fn bindgen_test_layout_XrSystemTrackingProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrSystemTrackingProperties> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSystemTrackingProperties>(),
        8usize,
        concat!("Size of: ", stringify!(XrSystemTrackingProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSystemTrackingProperties>(),
        4usize,
        concat!("Alignment of ", stringify!(XrSystemTrackingProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientationTracking) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemTrackingProperties),
            "::",
            stringify!(orientationTracking)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).positionTracking) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemTrackingProperties),
            "::",
            stringify!(positionTracking)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub systemId: XrSystemId,
    pub vendorId: u32,
    pub systemName: [::std::os::raw::c_char; 256usize],
    pub graphicsProperties: XrSystemGraphicsProperties,
    pub trackingProperties: XrSystemTrackingProperties,
}
#[test]
fn bindgen_test_layout_XrSystemProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrSystemProperties> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSystemProperties>(),
        304usize,
        concat!("Size of: ", stringify!(XrSystemProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSystemProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSystemProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(systemId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vendorId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(vendorId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemName) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(systemName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).graphicsProperties) as usize - ptr as usize },
        284usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(graphicsProperties)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).trackingProperties) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemProperties),
            "::",
            stringify!(trackingProperties)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrSessionCreateFlags,
    pub systemId: XrSystemId,
}
#[test]
fn bindgen_test_layout_XrSessionCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSessionCreateInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSessionCreateInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrSessionCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSessionCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSessionCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfo),
            "::",
            stringify!(createFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).systemId) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfo),
            "::",
            stringify!(systemId)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector3f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[test]
fn bindgen_test_layout_XrVector3f() {
    const UNINIT: ::std::mem::MaybeUninit<XrVector3f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrVector3f>(),
        12usize,
        concat!("Size of: ", stringify!(XrVector3f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrVector3f>(),
        4usize,
        concat!("Alignment of ", stringify!(XrVector3f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector3f),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector3f),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector3f),
            "::",
            stringify!(z)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocity {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub velocityFlags: XrSpaceVelocityFlags,
    pub linearVelocity: XrVector3f,
    pub angularVelocity: XrVector3f,
}
#[test]
fn bindgen_test_layout_XrSpaceVelocity() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceVelocity> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceVelocity>(),
        48usize,
        concat!("Size of: ", stringify!(XrSpaceVelocity))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceVelocity>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceVelocity))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocity),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocity),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocityFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocity),
            "::",
            stringify!(velocityFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linearVelocity) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocity),
            "::",
            stringify!(linearVelocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angularVelocity) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocity),
            "::",
            stringify!(angularVelocity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrQuaternionf {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_XrQuaternionf() {
    const UNINIT: ::std::mem::MaybeUninit<XrQuaternionf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrQuaternionf>(),
        16usize,
        concat!("Size of: ", stringify!(XrQuaternionf))
    );
    assert_eq!(
        ::std::mem::align_of::<XrQuaternionf>(),
        4usize,
        concat!("Alignment of ", stringify!(XrQuaternionf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrQuaternionf),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrQuaternionf),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrQuaternionf),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XrQuaternionf),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrPosef {
    pub orientation: XrQuaternionf,
    pub position: XrVector3f,
}
#[test]
fn bindgen_test_layout_XrPosef() {
    const UNINIT: ::std::mem::MaybeUninit<XrPosef> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrPosef>(),
        28usize,
        concat!("Size of: ", stringify!(XrPosef))
    );
    assert_eq!(
        ::std::mem::align_of::<XrPosef>(),
        4usize,
        concat!("Alignment of ", stringify!(XrPosef))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrPosef),
            "::",
            stringify!(orientation)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).position) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrPosef),
            "::",
            stringify!(position)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrReferenceSpaceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub referenceSpaceType: XrReferenceSpaceType,
    pub poseInReferenceSpace: XrPosef,
}
#[test]
fn bindgen_test_layout_XrReferenceSpaceCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrReferenceSpaceCreateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrReferenceSpaceCreateInfo>(),
        48usize,
        concat!("Size of: ", stringify!(XrReferenceSpaceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrReferenceSpaceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrReferenceSpaceCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrReferenceSpaceCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrReferenceSpaceCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referenceSpaceType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrReferenceSpaceCreateInfo),
            "::",
            stringify!(referenceSpaceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poseInReferenceSpace) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrReferenceSpaceCreateInfo),
            "::",
            stringify!(poseInReferenceSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent2Df {
    pub width: f32,
    pub height: f32,
}
#[test]
fn bindgen_test_layout_XrExtent2Df() {
    const UNINIT: ::std::mem::MaybeUninit<XrExtent2Df> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrExtent2Df>(),
        8usize,
        concat!("Size of: ", stringify!(XrExtent2Df))
    );
    assert_eq!(
        ::std::mem::align_of::<XrExtent2Df>(),
        4usize,
        concat!("Alignment of ", stringify!(XrExtent2Df))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent2Df),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent2Df),
            "::",
            stringify!(height)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSpaceCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
    pub poseInActionSpace: XrPosef,
}
#[test]
fn bindgen_test_layout_XrActionSpaceCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionSpaceCreateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionSpaceCreateInfo>(),
        64usize,
        concat!("Size of: ", stringify!(XrActionSpaceCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionSpaceCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionSpaceCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSpaceCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSpaceCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSpaceCreateInfo),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subactionPath) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSpaceCreateInfo),
            "::",
            stringify!(subactionPath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poseInActionSpace) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSpaceCreateInfo),
            "::",
            stringify!(poseInActionSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocation {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[test]
fn bindgen_test_layout_XrSpaceLocation() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceLocation> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceLocation>(),
        56usize,
        concat!("Size of: ", stringify!(XrSpaceLocation))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceLocation>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceLocation))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocation),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocation),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locationFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocation),
            "::",
            stringify!(locationFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocation),
            "::",
            stringify!(pose)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationProperties {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub fovMutable: XrBool32,
}
#[test]
fn bindgen_test_layout_XrViewConfigurationProperties() {
    const UNINIT: ::std::mem::MaybeUninit<XrViewConfigurationProperties> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrViewConfigurationProperties>(),
        24usize,
        concat!("Size of: ", stringify!(XrViewConfigurationProperties))
    );
    assert_eq!(
        ::std::mem::align_of::<XrViewConfigurationProperties>(),
        8usize,
        concat!("Alignment of ", stringify!(XrViewConfigurationProperties))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationProperties),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationProperties),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewConfigurationType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationProperties),
            "::",
            stringify!(viewConfigurationType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fovMutable) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationProperties),
            "::",
            stringify!(fovMutable)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewConfigurationView {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub recommendedImageRectWidth: u32,
    pub maxImageRectWidth: u32,
    pub recommendedImageRectHeight: u32,
    pub maxImageRectHeight: u32,
    pub recommendedSwapchainSampleCount: u32,
    pub maxSwapchainSampleCount: u32,
}
#[test]
fn bindgen_test_layout_XrViewConfigurationView() {
    const UNINIT: ::std::mem::MaybeUninit<XrViewConfigurationView> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrViewConfigurationView>(),
        40usize,
        concat!("Size of: ", stringify!(XrViewConfigurationView))
    );
    assert_eq!(
        ::std::mem::align_of::<XrViewConfigurationView>(),
        8usize,
        concat!("Alignment of ", stringify!(XrViewConfigurationView))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recommendedImageRectWidth) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(recommendedImageRectWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxImageRectWidth) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(maxImageRectWidth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).recommendedImageRectHeight) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(recommendedImageRectHeight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxImageRectHeight) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(maxImageRectHeight)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).recommendedSwapchainSampleCount) as usize - ptr as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(recommendedSwapchainSampleCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxSwapchainSampleCount) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewConfigurationView),
            "::",
            stringify!(maxSwapchainSampleCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrSwapchainCreateFlags,
    pub usageFlags: XrSwapchainUsageFlags,
    pub format: i64,
    pub sampleCount: u32,
    pub width: u32,
    pub height: u32,
    pub faceCount: u32,
    pub arraySize: u32,
    pub mipCount: u32,
}
#[test]
fn bindgen_test_layout_XrSwapchainCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainCreateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainCreateInfo>(),
        64usize,
        concat!("Size of: ", stringify!(XrSwapchainCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(createFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).usageFlags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(usageFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampleCount) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(sampleCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).faceCount) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(faceCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).arraySize) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(arraySize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mipCount) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainCreateInfo),
            "::",
            stringify!(mipCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageBaseHeader {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrSwapchainImageBaseHeader() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainImageBaseHeader> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainImageBaseHeader>(),
        16usize,
        concat!("Size of: ", stringify!(XrSwapchainImageBaseHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainImageBaseHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainImageBaseHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageBaseHeader),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageBaseHeader),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageAcquireInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrSwapchainImageAcquireInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainImageAcquireInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainImageAcquireInfo>(),
        16usize,
        concat!("Size of: ", stringify!(XrSwapchainImageAcquireInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainImageAcquireInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainImageAcquireInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageAcquireInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageAcquireInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageWaitInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub timeout: XrDuration,
}
#[test]
fn bindgen_test_layout_XrSwapchainImageWaitInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainImageWaitInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainImageWaitInfo>(),
        24usize,
        concat!("Size of: ", stringify!(XrSwapchainImageWaitInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainImageWaitInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainImageWaitInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageWaitInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageWaitInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).timeout) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageWaitInfo),
            "::",
            stringify!(timeout)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainImageReleaseInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrSwapchainImageReleaseInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainImageReleaseInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainImageReleaseInfo>(),
        16usize,
        concat!("Size of: ", stringify!(XrSwapchainImageReleaseInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainImageReleaseInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainImageReleaseInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageReleaseInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainImageReleaseInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionBeginInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub primaryViewConfigurationType: XrViewConfigurationType,
}
#[test]
fn bindgen_test_layout_XrSessionBeginInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSessionBeginInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSessionBeginInfo>(),
        24usize,
        concat!("Size of: ", stringify!(XrSessionBeginInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSessionBeginInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSessionBeginInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionBeginInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionBeginInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).primaryViewConfigurationType) as usize - ptr as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionBeginInfo),
            "::",
            stringify!(primaryViewConfigurationType)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameWaitInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrFrameWaitInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrFrameWaitInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFrameWaitInfo>(),
        16usize,
        concat!("Size of: ", stringify!(XrFrameWaitInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFrameWaitInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrFrameWaitInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameWaitInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameWaitInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub predictedDisplayTime: XrTime,
    pub predictedDisplayPeriod: XrDuration,
    pub shouldRender: XrBool32,
}
#[test]
fn bindgen_test_layout_XrFrameState() {
    const UNINIT: ::std::mem::MaybeUninit<XrFrameState> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFrameState>(),
        40usize,
        concat!("Size of: ", stringify!(XrFrameState))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFrameState>(),
        8usize,
        concat!("Alignment of ", stringify!(XrFrameState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameState),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameState),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).predictedDisplayTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameState),
            "::",
            stringify!(predictedDisplayTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).predictedDisplayPeriod) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameState),
            "::",
            stringify!(predictedDisplayPeriod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).shouldRender) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameState),
            "::",
            stringify!(shouldRender)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameBeginInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrFrameBeginInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrFrameBeginInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFrameBeginInfo>(),
        16usize,
        concat!("Size of: ", stringify!(XrFrameBeginInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFrameBeginInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrFrameBeginInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameBeginInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameBeginInfo),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerBaseHeader() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerBaseHeader> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerBaseHeader>(),
        32usize,
        concat!("Size of: ", stringify!(XrCompositionLayerBaseHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerBaseHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerBaseHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerBaseHeader),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerBaseHeader),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerBaseHeader),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerBaseHeader),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrameEndInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub displayTime: XrTime,
    pub environmentBlendMode: XrEnvironmentBlendMode,
    pub layerCount: u32,
    pub layers: *const *const XrCompositionLayerBaseHeader,
}
#[test]
fn bindgen_test_layout_XrFrameEndInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrFrameEndInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFrameEndInfo>(),
        40usize,
        concat!("Size of: ", stringify!(XrFrameEndInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFrameEndInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrFrameEndInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(displayTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).environmentBlendMode) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(environmentBlendMode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerCount) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(layerCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layers) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrameEndInfo),
            "::",
            stringify!(layers)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewLocateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub viewConfigurationType: XrViewConfigurationType,
    pub displayTime: XrTime,
    pub space: XrSpace,
}
#[test]
fn bindgen_test_layout_XrViewLocateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrViewLocateInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrViewLocateInfo>(),
        40usize,
        concat!("Size of: ", stringify!(XrViewLocateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrViewLocateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrViewLocateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewLocateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewLocateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewConfigurationType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewLocateInfo),
            "::",
            stringify!(viewConfigurationType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).displayTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewLocateInfo),
            "::",
            stringify!(displayTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewLocateInfo),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrViewState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub viewStateFlags: XrViewStateFlags,
}
#[test]
fn bindgen_test_layout_XrViewState() {
    const UNINIT: ::std::mem::MaybeUninit<XrViewState> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrViewState>(),
        24usize,
        concat!("Size of: ", stringify!(XrViewState))
    );
    assert_eq!(
        ::std::mem::align_of::<XrViewState>(),
        8usize,
        concat!("Alignment of ", stringify!(XrViewState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewState),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewState),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewStateFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrViewState),
            "::",
            stringify!(viewStateFlags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFovf {
    pub angleLeft: f32,
    pub angleRight: f32,
    pub angleUp: f32,
    pub angleDown: f32,
}
#[test]
fn bindgen_test_layout_XrFovf() {
    const UNINIT: ::std::mem::MaybeUninit<XrFovf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFovf>(),
        16usize,
        concat!("Size of: ", stringify!(XrFovf))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFovf>(),
        4usize,
        concat!("Alignment of ", stringify!(XrFovf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angleLeft) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFovf),
            "::",
            stringify!(angleLeft)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angleRight) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFovf),
            "::",
            stringify!(angleRight)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angleUp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFovf),
            "::",
            stringify!(angleUp)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angleDown) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFovf),
            "::",
            stringify!(angleDown)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrView {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub pose: XrPosef,
    pub fov: XrFovf,
}
#[test]
fn bindgen_test_layout_XrView() {
    const UNINIT: ::std::mem::MaybeUninit<XrView> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrView>(),
        64usize,
        concat!("Size of: ", stringify!(XrView))
    );
    assert_eq!(
        ::std::mem::align_of::<XrView>(),
        8usize,
        concat!("Alignment of ", stringify!(XrView))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrView),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrView),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrView),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fov) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XrView),
            "::",
            stringify!(fov)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSetCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub actionSetName: [::std::os::raw::c_char; 64usize],
    pub localizedActionSetName: [::std::os::raw::c_char; 128usize],
    pub priority: u32,
}
#[test]
fn bindgen_test_layout_XrActionSetCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionSetCreateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionSetCreateInfo>(),
        216usize,
        concat!("Size of: ", stringify!(XrActionSetCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionSetCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionSetCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSetCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSetCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actionSetName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSetCreateInfo),
            "::",
            stringify!(actionSetName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localizedActionSetName) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSetCreateInfo),
            "::",
            stringify!(localizedActionSetName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).priority) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSetCreateInfo),
            "::",
            stringify!(priority)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionCreateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub actionName: [::std::os::raw::c_char; 64usize],
    pub actionType: XrActionType,
    pub countSubactionPaths: u32,
    pub subactionPaths: *const XrPath,
    pub localizedActionName: [::std::os::raw::c_char; 128usize],
}
#[test]
fn bindgen_test_layout_XrActionCreateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionCreateInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionCreateInfo>(),
        224usize,
        concat!("Size of: ", stringify!(XrActionCreateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionCreateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionCreateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actionName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(actionName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actionType) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(actionType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).countSubactionPaths) as usize - ptr as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(countSubactionPaths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subactionPaths) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(subactionPaths)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).localizedActionName) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionCreateInfo),
            "::",
            stringify!(localizedActionName)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionSuggestedBinding {
    pub action: XrAction,
    pub binding: XrPath,
}
#[test]
fn bindgen_test_layout_XrActionSuggestedBinding() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionSuggestedBinding> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionSuggestedBinding>(),
        16usize,
        concat!("Size of: ", stringify!(XrActionSuggestedBinding))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionSuggestedBinding>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionSuggestedBinding))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSuggestedBinding),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionSuggestedBinding),
            "::",
            stringify!(binding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileSuggestedBinding {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub interactionProfile: XrPath,
    pub countSuggestedBindings: u32,
    pub suggestedBindings: *const XrActionSuggestedBinding,
}
#[test]
fn bindgen_test_layout_XrInteractionProfileSuggestedBinding() {
    const UNINIT: ::std::mem::MaybeUninit<XrInteractionProfileSuggestedBinding> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrInteractionProfileSuggestedBinding>(),
        40usize,
        concat!(
            "Size of: ",
            stringify!(XrInteractionProfileSuggestedBinding)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrInteractionProfileSuggestedBinding>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrInteractionProfileSuggestedBinding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileSuggestedBinding),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileSuggestedBinding),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interactionProfile) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileSuggestedBinding),
            "::",
            stringify!(interactionProfile)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).countSuggestedBindings) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileSuggestedBinding),
            "::",
            stringify!(countSuggestedBindings)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).suggestedBindings) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileSuggestedBinding),
            "::",
            stringify!(suggestedBindings)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionActionSetsAttachInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub countActionSets: u32,
    pub actionSets: *const XrActionSet,
}
#[test]
fn bindgen_test_layout_XrSessionActionSetsAttachInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSessionActionSetsAttachInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSessionActionSetsAttachInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrSessionActionSetsAttachInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSessionActionSetsAttachInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSessionActionSetsAttachInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionActionSetsAttachInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionActionSetsAttachInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).countActionSets) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionActionSetsAttachInfo),
            "::",
            stringify!(countActionSets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actionSets) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionActionSetsAttachInfo),
            "::",
            stringify!(actionSets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInteractionProfileState {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub interactionProfile: XrPath,
}
#[test]
fn bindgen_test_layout_XrInteractionProfileState() {
    const UNINIT: ::std::mem::MaybeUninit<XrInteractionProfileState> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrInteractionProfileState>(),
        24usize,
        concat!("Size of: ", stringify!(XrInteractionProfileState))
    );
    assert_eq!(
        ::std::mem::align_of::<XrInteractionProfileState>(),
        8usize,
        concat!("Alignment of ", stringify!(XrInteractionProfileState))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileState),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileState),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).interactionProfile) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInteractionProfileState),
            "::",
            stringify!(interactionProfile)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
}
#[test]
fn bindgen_test_layout_XrActionStateGetInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionStateGetInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionStateGetInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrActionStateGetInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionStateGetInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionStateGetInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateGetInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateGetInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateGetInfo),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subactionPath) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateGetInfo),
            "::",
            stringify!(subactionPath)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateBoolean {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: XrBool32,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[test]
fn bindgen_test_layout_XrActionStateBoolean() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionStateBoolean> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionStateBoolean>(),
        40usize,
        concat!("Size of: ", stringify!(XrActionStateBoolean))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionStateBoolean>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionStateBoolean))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentState) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(currentState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changedSinceLastSync) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(changedSinceLastSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastChangeTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(lastChangeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isActive) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateBoolean),
            "::",
            stringify!(isActive)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateFloat {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: f32,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[test]
fn bindgen_test_layout_XrActionStateFloat() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionStateFloat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionStateFloat>(),
        40usize,
        concat!("Size of: ", stringify!(XrActionStateFloat))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionStateFloat>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionStateFloat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentState) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(currentState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changedSinceLastSync) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(changedSinceLastSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastChangeTime) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(lastChangeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isActive) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateFloat),
            "::",
            stringify!(isActive)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector2f {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_XrVector2f() {
    const UNINIT: ::std::mem::MaybeUninit<XrVector2f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrVector2f>(),
        8usize,
        concat!("Size of: ", stringify!(XrVector2f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrVector2f>(),
        4usize,
        concat!("Alignment of ", stringify!(XrVector2f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector2f),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector2f),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStateVector2f {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub currentState: XrVector2f,
    pub changedSinceLastSync: XrBool32,
    pub lastChangeTime: XrTime,
    pub isActive: XrBool32,
}
#[test]
fn bindgen_test_layout_XrActionStateVector2f() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionStateVector2f> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionStateVector2f>(),
        48usize,
        concat!("Size of: ", stringify!(XrActionStateVector2f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionStateVector2f>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionStateVector2f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).currentState) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(currentState)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changedSinceLastSync) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(changedSinceLastSync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastChangeTime) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(lastChangeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isActive) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStateVector2f),
            "::",
            stringify!(isActive)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionStatePose {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub isActive: XrBool32,
}
#[test]
fn bindgen_test_layout_XrActionStatePose() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionStatePose> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionStatePose>(),
        24usize,
        concat!("Size of: ", stringify!(XrActionStatePose))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionStatePose>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionStatePose))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStatePose),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStatePose),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).isActive) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionStatePose),
            "::",
            stringify!(isActive)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActiveActionSet {
    pub actionSet: XrActionSet,
    pub subactionPath: XrPath,
}
#[test]
fn bindgen_test_layout_XrActiveActionSet() {
    const UNINIT: ::std::mem::MaybeUninit<XrActiveActionSet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActiveActionSet>(),
        16usize,
        concat!("Size of: ", stringify!(XrActiveActionSet))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActiveActionSet>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActiveActionSet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).actionSet) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActiveActionSet),
            "::",
            stringify!(actionSet)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subactionPath) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActiveActionSet),
            "::",
            stringify!(subactionPath)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrActionsSyncInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub countActiveActionSets: u32,
    pub activeActionSets: *const XrActiveActionSet,
}
#[test]
fn bindgen_test_layout_XrActionsSyncInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrActionsSyncInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrActionsSyncInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrActionsSyncInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrActionsSyncInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrActionsSyncInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionsSyncInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionsSyncInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).countActiveActionSets) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionsSyncInfo),
            "::",
            stringify!(countActiveActionSets)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).activeActionSets) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrActionsSyncInfo),
            "::",
            stringify!(activeActionSets)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBoundSourcesForActionEnumerateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
}
#[test]
fn bindgen_test_layout_XrBoundSourcesForActionEnumerateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrBoundSourcesForActionEnumerateInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBoundSourcesForActionEnumerateInfo>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(XrBoundSourcesForActionEnumerateInfo)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrBoundSourcesForActionEnumerateInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrBoundSourcesForActionEnumerateInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBoundSourcesForActionEnumerateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBoundSourcesForActionEnumerateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBoundSourcesForActionEnumerateInfo),
            "::",
            stringify!(action)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrInputSourceLocalizedNameGetInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub sourcePath: XrPath,
    pub whichComponents: XrInputSourceLocalizedNameFlags,
}
#[test]
fn bindgen_test_layout_XrInputSourceLocalizedNameGetInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrInputSourceLocalizedNameGetInfo> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrInputSourceLocalizedNameGetInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrInputSourceLocalizedNameGetInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrInputSourceLocalizedNameGetInfo>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrInputSourceLocalizedNameGetInfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInputSourceLocalizedNameGetInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInputSourceLocalizedNameGetInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourcePath) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInputSourceLocalizedNameGetInfo),
            "::",
            stringify!(sourcePath)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).whichComponents) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrInputSourceLocalizedNameGetInfo),
            "::",
            stringify!(whichComponents)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticActionInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub action: XrAction,
    pub subactionPath: XrPath,
}
#[test]
fn bindgen_test_layout_XrHapticActionInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrHapticActionInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrHapticActionInfo>(),
        32usize,
        concat!("Size of: ", stringify!(XrHapticActionInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrHapticActionInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrHapticActionInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticActionInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticActionInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).action) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticActionInfo),
            "::",
            stringify!(action)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subactionPath) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticActionInfo),
            "::",
            stringify!(subactionPath)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrHapticBaseHeader() {
    const UNINIT: ::std::mem::MaybeUninit<XrHapticBaseHeader> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrHapticBaseHeader>(),
        16usize,
        concat!("Size of: ", stringify!(XrHapticBaseHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<XrHapticBaseHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(XrHapticBaseHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticBaseHeader),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticBaseHeader),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBaseInStructure {
    pub type_: XrStructureType,
    pub next: *const XrBaseInStructure,
}
#[test]
fn bindgen_test_layout_XrBaseInStructure() {
    const UNINIT: ::std::mem::MaybeUninit<XrBaseInStructure> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBaseInStructure>(),
        16usize,
        concat!("Size of: ", stringify!(XrBaseInStructure))
    );
    assert_eq!(
        ::std::mem::align_of::<XrBaseInStructure>(),
        8usize,
        concat!("Alignment of ", stringify!(XrBaseInStructure))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBaseInStructure),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBaseInStructure),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBaseOutStructure {
    pub type_: XrStructureType,
    pub next: *mut XrBaseOutStructure,
}
#[test]
fn bindgen_test_layout_XrBaseOutStructure() {
    const UNINIT: ::std::mem::MaybeUninit<XrBaseOutStructure> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBaseOutStructure>(),
        16usize,
        concat!("Size of: ", stringify!(XrBaseOutStructure))
    );
    assert_eq!(
        ::std::mem::align_of::<XrBaseOutStructure>(),
        8usize,
        concat!("Alignment of ", stringify!(XrBaseOutStructure))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBaseOutStructure),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBaseOutStructure),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrOffset2Di {
    pub x: i32,
    pub y: i32,
}
#[test]
fn bindgen_test_layout_XrOffset2Di() {
    const UNINIT: ::std::mem::MaybeUninit<XrOffset2Di> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrOffset2Di>(),
        8usize,
        concat!("Size of: ", stringify!(XrOffset2Di))
    );
    assert_eq!(
        ::std::mem::align_of::<XrOffset2Di>(),
        4usize,
        concat!("Alignment of ", stringify!(XrOffset2Di))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrOffset2Di),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrOffset2Di),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent2Di {
    pub width: i32,
    pub height: i32,
}
#[test]
fn bindgen_test_layout_XrExtent2Di() {
    const UNINIT: ::std::mem::MaybeUninit<XrExtent2Di> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrExtent2Di>(),
        8usize,
        concat!("Size of: ", stringify!(XrExtent2Di))
    );
    assert_eq!(
        ::std::mem::align_of::<XrExtent2Di>(),
        4usize,
        concat!("Alignment of ", stringify!(XrExtent2Di))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent2Di),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent2Di),
            "::",
            stringify!(height)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrRect2Di {
    pub offset: XrOffset2Di,
    pub extent: XrExtent2Di,
}
#[test]
fn bindgen_test_layout_XrRect2Di() {
    const UNINIT: ::std::mem::MaybeUninit<XrRect2Di> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrRect2Di>(),
        16usize,
        concat!("Size of: ", stringify!(XrRect2Di))
    );
    assert_eq!(
        ::std::mem::align_of::<XrRect2Di>(),
        4usize,
        concat!("Alignment of ", stringify!(XrRect2Di))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrRect2Di),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrRect2Di),
            "::",
            stringify!(extent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSwapchainSubImage {
    pub swapchain: XrSwapchain,
    pub imageRect: XrRect2Di,
    pub imageArrayIndex: u32,
}
#[test]
fn bindgen_test_layout_XrSwapchainSubImage() {
    const UNINIT: ::std::mem::MaybeUninit<XrSwapchainSubImage> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSwapchainSubImage>(),
        32usize,
        concat!("Size of: ", stringify!(XrSwapchainSubImage))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSwapchainSubImage>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSwapchainSubImage))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).swapchain) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainSubImage),
            "::",
            stringify!(swapchain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imageRect) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainSubImage),
            "::",
            stringify!(imageRect)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imageArrayIndex) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSwapchainSubImage),
            "::",
            stringify!(imageArrayIndex)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerProjectionView {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub pose: XrPosef,
    pub fov: XrFovf,
    pub subImage: XrSwapchainSubImage,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerProjectionView() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerProjectionView> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerProjectionView>(),
        96usize,
        concat!("Size of: ", stringify!(XrCompositionLayerProjectionView))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerProjectionView>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrCompositionLayerProjectionView)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjectionView),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjectionView),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjectionView),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fov) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjectionView),
            "::",
            stringify!(fov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjectionView),
            "::",
            stringify!(subImage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerProjection {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub viewCount: u32,
    pub views: *const XrCompositionLayerProjectionView,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerProjection() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerProjection> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerProjection>(),
        48usize,
        concat!("Size of: ", stringify!(XrCompositionLayerProjection))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerProjection>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerProjection))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewCount) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(viewCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).views) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerProjection),
            "::",
            stringify!(views)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerQuad {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub size: XrExtent2Df,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerQuad() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerQuad> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerQuad>(),
        112usize,
        concat!("Size of: ", stringify!(XrCompositionLayerQuad))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerQuad>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerQuad))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eyeVisibility) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(eyeVisibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(subImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerQuad),
            "::",
            stringify!(size)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataBaseHeader {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrEventDataBaseHeader() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataBaseHeader> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataBaseHeader>(),
        16usize,
        concat!("Size of: ", stringify!(XrEventDataBaseHeader))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataBaseHeader>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataBaseHeader))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataBaseHeader),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataBaseHeader),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataEventsLost {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub lostEventCount: u32,
}
#[test]
fn bindgen_test_layout_XrEventDataEventsLost() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataEventsLost> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataEventsLost>(),
        24usize,
        concat!("Size of: ", stringify!(XrEventDataEventsLost))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataEventsLost>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataEventsLost))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataEventsLost),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataEventsLost),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lostEventCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataEventsLost),
            "::",
            stringify!(lostEventCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataInstanceLossPending {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub lossTime: XrTime,
}
#[test]
fn bindgen_test_layout_XrEventDataInstanceLossPending() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataInstanceLossPending> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataInstanceLossPending>(),
        24usize,
        concat!("Size of: ", stringify!(XrEventDataInstanceLossPending))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataInstanceLossPending>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataInstanceLossPending))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInstanceLossPending),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInstanceLossPending),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lossTime) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInstanceLossPending),
            "::",
            stringify!(lossTime)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataSessionStateChanged {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub state: XrSessionState,
    pub time: XrTime,
}
#[test]
fn bindgen_test_layout_XrEventDataSessionStateChanged() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataSessionStateChanged> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataSessionStateChanged>(),
        40usize,
        concat!("Size of: ", stringify!(XrEventDataSessionStateChanged))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataSessionStateChanged>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataSessionStateChanged))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataSessionStateChanged),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataSessionStateChanged),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataSessionStateChanged),
            "::",
            stringify!(session)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataSessionStateChanged),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataSessionStateChanged),
            "::",
            stringify!(time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataReferenceSpaceChangePending {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub referenceSpaceType: XrReferenceSpaceType,
    pub changeTime: XrTime,
    pub poseValid: XrBool32,
    pub poseInPreviousSpace: XrPosef,
}
#[test]
fn bindgen_test_layout_XrEventDataReferenceSpaceChangePending() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataReferenceSpaceChangePending> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataReferenceSpaceChangePending>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(XrEventDataReferenceSpaceChangePending)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataReferenceSpaceChangePending>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrEventDataReferenceSpaceChangePending)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(session)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).referenceSpaceType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(referenceSpaceType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).changeTime) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(changeTime)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poseValid) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(poseValid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poseInPreviousSpace) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataReferenceSpaceChangePending),
            "::",
            stringify!(poseInPreviousSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataInteractionProfileChanged {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
}
#[test]
fn bindgen_test_layout_XrEventDataInteractionProfileChanged() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataInteractionProfileChanged> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataInteractionProfileChanged>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(XrEventDataInteractionProfileChanged)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataInteractionProfileChanged>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrEventDataInteractionProfileChanged)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInteractionProfileChanged),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInteractionProfileChanged),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataInteractionProfileChanged),
            "::",
            stringify!(session)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrHapticVibration {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub duration: XrDuration,
    pub frequency: f32,
    pub amplitude: f32,
}
#[test]
fn bindgen_test_layout_XrHapticVibration() {
    const UNINIT: ::std::mem::MaybeUninit<XrHapticVibration> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrHapticVibration>(),
        32usize,
        concat!("Size of: ", stringify!(XrHapticVibration))
    );
    assert_eq!(
        ::std::mem::align_of::<XrHapticVibration>(),
        8usize,
        concat!("Alignment of ", stringify!(XrHapticVibration))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticVibration),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticVibration),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).duration) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticVibration),
            "::",
            stringify!(duration)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).frequency) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticVibration),
            "::",
            stringify!(frequency)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).amplitude) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrHapticVibration),
            "::",
            stringify!(amplitude)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrOffset2Df {
    pub x: f32,
    pub y: f32,
}
#[test]
fn bindgen_test_layout_XrOffset2Df() {
    const UNINIT: ::std::mem::MaybeUninit<XrOffset2Df> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrOffset2Df>(),
        8usize,
        concat!("Size of: ", stringify!(XrOffset2Df))
    );
    assert_eq!(
        ::std::mem::align_of::<XrOffset2Df>(),
        4usize,
        concat!("Alignment of ", stringify!(XrOffset2Df))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrOffset2Df),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrOffset2Df),
            "::",
            stringify!(y)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrRect2Df {
    pub offset: XrOffset2Df,
    pub extent: XrExtent2Df,
}
#[test]
fn bindgen_test_layout_XrRect2Df() {
    const UNINIT: ::std::mem::MaybeUninit<XrRect2Df> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrRect2Df>(),
        16usize,
        concat!("Size of: ", stringify!(XrRect2Df))
    );
    assert_eq!(
        ::std::mem::align_of::<XrRect2Df>(),
        4usize,
        concat!("Alignment of ", stringify!(XrRect2Df))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrRect2Df),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extent) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrRect2Df),
            "::",
            stringify!(extent)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVector4f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[test]
fn bindgen_test_layout_XrVector4f() {
    const UNINIT: ::std::mem::MaybeUninit<XrVector4f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrVector4f>(),
        16usize,
        concat!("Size of: ", stringify!(XrVector4f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrVector4f>(),
        4usize,
        concat!("Alignment of ", stringify!(XrVector4f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector4f),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector4f),
            "::",
            stringify!(y)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).z) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector4f),
            "::",
            stringify!(z)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).w) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVector4f),
            "::",
            stringify!(w)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrColor4f {
    pub r: f32,
    pub g: f32,
    pub b: f32,
    pub a: f32,
}
#[test]
fn bindgen_test_layout_XrColor4f() {
    const UNINIT: ::std::mem::MaybeUninit<XrColor4f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrColor4f>(),
        16usize,
        concat!("Size of: ", stringify!(XrColor4f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrColor4f>(),
        4usize,
        concat!("Alignment of ", stringify!(XrColor4f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor4f),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor4f),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor4f),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).a) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor4f),
            "::",
            stringify!(a)
        )
    );
}
pub type PFN_xrGetInstanceProcAddr = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        name: *const ::std::os::raw::c_char,
        function: *mut PFN_xrVoidFunction,
    ) -> XrResult,
>;
pub type PFN_xrEnumerateApiLayerProperties = ::std::option::Option<
    unsafe extern "C" fn(
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrApiLayerProperties,
    ) -> XrResult,
>;
pub type PFN_xrEnumerateInstanceExtensionProperties = ::std::option::Option<
    unsafe extern "C" fn(
        layerName: *const ::std::os::raw::c_char,
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrExtensionProperties,
    ) -> XrResult,
>;
pub type PFN_xrCreateInstance = ::std::option::Option<
    unsafe extern "C" fn(
        createInfo: *const XrInstanceCreateInfo,
        instance: *mut XrInstance,
    ) -> XrResult,
>;
pub type PFN_xrDestroyInstance =
    ::std::option::Option<unsafe extern "C" fn(instance: XrInstance) -> XrResult>;
pub type PFN_xrGetInstanceProperties = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        instanceProperties: *mut XrInstanceProperties,
    ) -> XrResult,
>;
pub type PFN_xrPollEvent = ::std::option::Option<
    unsafe extern "C" fn(instance: XrInstance, eventData: *mut XrEventDataBuffer) -> XrResult,
>;
pub type PFN_xrResultToString = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        value: XrResult,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult,
>;
pub type PFN_xrStructureTypeToString = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        value: XrStructureType,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult,
>;
pub type PFN_xrGetSystem = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        getInfo: *const XrSystemGetInfo,
        systemId: *mut XrSystemId,
    ) -> XrResult,
>;
pub type PFN_xrGetSystemProperties = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        systemId: XrSystemId,
        properties: *mut XrSystemProperties,
    ) -> XrResult,
>;
pub type PFN_xrEnumerateEnvironmentBlendModes = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        environmentBlendModeCapacityInput: u32,
        environmentBlendModeCountOutput: *mut u32,
        environmentBlendModes: *mut XrEnvironmentBlendMode,
    ) -> XrResult,
>;
pub type PFN_xrCreateSession = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        createInfo: *const XrSessionCreateInfo,
        session: *mut XrSession,
    ) -> XrResult,
>;
pub type PFN_xrDestroySession =
    ::std::option::Option<unsafe extern "C" fn(session: XrSession) -> XrResult>;
pub type PFN_xrEnumerateReferenceSpaces = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        spaceCapacityInput: u32,
        spaceCountOutput: *mut u32,
        spaces: *mut XrReferenceSpaceType,
    ) -> XrResult,
>;
pub type PFN_xrCreateReferenceSpace = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        createInfo: *const XrReferenceSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult,
>;
pub type PFN_xrGetReferenceSpaceBoundsRect = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        referenceSpaceType: XrReferenceSpaceType,
        bounds: *mut XrExtent2Df,
    ) -> XrResult,
>;
pub type PFN_xrCreateActionSpace = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        createInfo: *const XrActionSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult,
>;
pub type PFN_xrLocateSpace = ::std::option::Option<
    unsafe extern "C" fn(
        space: XrSpace,
        baseSpace: XrSpace,
        time: XrTime,
        location: *mut XrSpaceLocation,
    ) -> XrResult,
>;
pub type PFN_xrDestroySpace =
    ::std::option::Option<unsafe extern "C" fn(space: XrSpace) -> XrResult>;
pub type PFN_xrEnumerateViewConfigurations = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationTypeCapacityInput: u32,
        viewConfigurationTypeCountOutput: *mut u32,
        viewConfigurationTypes: *mut XrViewConfigurationType,
    ) -> XrResult,
>;
pub type PFN_xrGetViewConfigurationProperties = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        configurationProperties: *mut XrViewConfigurationProperties,
    ) -> XrResult,
>;
pub type PFN_xrEnumerateViewConfigurationViews = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrViewConfigurationView,
    ) -> XrResult,
>;
pub type PFN_xrEnumerateSwapchainFormats = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        formatCapacityInput: u32,
        formatCountOutput: *mut u32,
        formats: *mut i64,
    ) -> XrResult,
>;
pub type PFN_xrCreateSwapchain = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        createInfo: *const XrSwapchainCreateInfo,
        swapchain: *mut XrSwapchain,
    ) -> XrResult,
>;
pub type PFN_xrDestroySwapchain =
    ::std::option::Option<unsafe extern "C" fn(swapchain: XrSwapchain) -> XrResult>;
pub type PFN_xrEnumerateSwapchainImages = ::std::option::Option<
    unsafe extern "C" fn(
        swapchain: XrSwapchain,
        imageCapacityInput: u32,
        imageCountOutput: *mut u32,
        images: *mut XrSwapchainImageBaseHeader,
    ) -> XrResult,
>;
pub type PFN_xrAcquireSwapchainImage = ::std::option::Option<
    unsafe extern "C" fn(
        swapchain: XrSwapchain,
        acquireInfo: *const XrSwapchainImageAcquireInfo,
        index: *mut u32,
    ) -> XrResult,
>;
pub type PFN_xrWaitSwapchainImage = ::std::option::Option<
    unsafe extern "C" fn(
        swapchain: XrSwapchain,
        waitInfo: *const XrSwapchainImageWaitInfo,
    ) -> XrResult,
>;
pub type PFN_xrReleaseSwapchainImage = ::std::option::Option<
    unsafe extern "C" fn(
        swapchain: XrSwapchain,
        releaseInfo: *const XrSwapchainImageReleaseInfo,
    ) -> XrResult,
>;
pub type PFN_xrBeginSession = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, beginInfo: *const XrSessionBeginInfo) -> XrResult,
>;
pub type PFN_xrEndSession =
    ::std::option::Option<unsafe extern "C" fn(session: XrSession) -> XrResult>;
pub type PFN_xrRequestExitSession =
    ::std::option::Option<unsafe extern "C" fn(session: XrSession) -> XrResult>;
pub type PFN_xrWaitFrame = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        frameWaitInfo: *const XrFrameWaitInfo,
        frameState: *mut XrFrameState,
    ) -> XrResult,
>;
pub type PFN_xrBeginFrame = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, frameBeginInfo: *const XrFrameBeginInfo) -> XrResult,
>;
pub type PFN_xrEndFrame = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, frameEndInfo: *const XrFrameEndInfo) -> XrResult,
>;
pub type PFN_xrLocateViews = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        viewLocateInfo: *const XrViewLocateInfo,
        viewState: *mut XrViewState,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrView,
    ) -> XrResult,
>;
pub type PFN_xrStringToPath = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        pathString: *const ::std::os::raw::c_char,
        path: *mut XrPath,
    ) -> XrResult,
>;
pub type PFN_xrPathToString = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        path: XrPath,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult,
>;
pub type PFN_xrCreateActionSet = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        createInfo: *const XrActionSetCreateInfo,
        actionSet: *mut XrActionSet,
    ) -> XrResult,
>;
pub type PFN_xrDestroyActionSet =
    ::std::option::Option<unsafe extern "C" fn(actionSet: XrActionSet) -> XrResult>;
pub type PFN_xrCreateAction = ::std::option::Option<
    unsafe extern "C" fn(
        actionSet: XrActionSet,
        createInfo: *const XrActionCreateInfo,
        action: *mut XrAction,
    ) -> XrResult,
>;
pub type PFN_xrDestroyAction =
    ::std::option::Option<unsafe extern "C" fn(action: XrAction) -> XrResult>;
pub type PFN_xrSuggestInteractionProfileBindings = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        suggestedBindings: *const XrInteractionProfileSuggestedBinding,
    ) -> XrResult,
>;
pub type PFN_xrAttachSessionActionSets = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        attachInfo: *const XrSessionActionSetsAttachInfo,
    ) -> XrResult,
>;
pub type PFN_xrGetCurrentInteractionProfile = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        topLevelUserPath: XrPath,
        interactionProfile: *mut XrInteractionProfileState,
    ) -> XrResult,
>;
pub type PFN_xrGetActionStateBoolean = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateBoolean,
    ) -> XrResult,
>;
pub type PFN_xrGetActionStateFloat = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateFloat,
    ) -> XrResult,
>;
pub type PFN_xrGetActionStateVector2f = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateVector2f,
    ) -> XrResult,
>;
pub type PFN_xrGetActionStatePose = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStatePose,
    ) -> XrResult,
>;
pub type PFN_xrSyncActions = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, syncInfo: *const XrActionsSyncInfo) -> XrResult,
>;
pub type PFN_xrEnumerateBoundSourcesForAction = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        enumerateInfo: *const XrBoundSourcesForActionEnumerateInfo,
        sourceCapacityInput: u32,
        sourceCountOutput: *mut u32,
        sources: *mut XrPath,
    ) -> XrResult,
>;
pub type PFN_xrGetInputSourceLocalizedName = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        getInfo: *const XrInputSourceLocalizedNameGetInfo,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult,
>;
pub type PFN_xrApplyHapticFeedback = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
        hapticFeedback: *const XrHapticBaseHeader,
    ) -> XrResult,
>;
pub type PFN_xrStopHapticFeedback = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
    ) -> XrResult,
>;
extern "C" {
    pub fn xrGetInstanceProcAddr(
        instance: XrInstance,
        name: *const ::std::os::raw::c_char,
        function: *mut PFN_xrVoidFunction,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateApiLayerProperties(
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrApiLayerProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateInstanceExtensionProperties(
        layerName: *const ::std::os::raw::c_char,
        propertyCapacityInput: u32,
        propertyCountOutput: *mut u32,
        properties: *mut XrExtensionProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateInstance(
        createInfo: *const XrInstanceCreateInfo,
        instance: *mut XrInstance,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyInstance(instance: XrInstance) -> XrResult;
}
extern "C" {
    pub fn xrGetInstanceProperties(
        instance: XrInstance,
        instanceProperties: *mut XrInstanceProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrPollEvent(instance: XrInstance, eventData: *mut XrEventDataBuffer) -> XrResult;
}
extern "C" {
    pub fn xrResultToString(
        instance: XrInstance,
        value: XrResult,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStructureTypeToString(
        instance: XrInstance,
        value: XrStructureType,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetSystem(
        instance: XrInstance,
        getInfo: *const XrSystemGetInfo,
        systemId: *mut XrSystemId,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetSystemProperties(
        instance: XrInstance,
        systemId: XrSystemId,
        properties: *mut XrSystemProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateEnvironmentBlendModes(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        environmentBlendModeCapacityInput: u32,
        environmentBlendModeCountOutput: *mut u32,
        environmentBlendModes: *mut XrEnvironmentBlendMode,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateSession(
        instance: XrInstance,
        createInfo: *const XrSessionCreateInfo,
        session: *mut XrSession,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateReferenceSpaces(
        session: XrSession,
        spaceCapacityInput: u32,
        spaceCountOutput: *mut u32,
        spaces: *mut XrReferenceSpaceType,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateReferenceSpace(
        session: XrSession,
        createInfo: *const XrReferenceSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetReferenceSpaceBoundsRect(
        session: XrSession,
        referenceSpaceType: XrReferenceSpaceType,
        bounds: *mut XrExtent2Df,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateActionSpace(
        session: XrSession,
        createInfo: *const XrActionSpaceCreateInfo,
        space: *mut XrSpace,
    ) -> XrResult;
}
extern "C" {
    pub fn xrLocateSpace(
        space: XrSpace,
        baseSpace: XrSpace,
        time: XrTime,
        location: *mut XrSpaceLocation,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySpace(space: XrSpace) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateViewConfigurations(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationTypeCapacityInput: u32,
        viewConfigurationTypeCountOutput: *mut u32,
        viewConfigurationTypes: *mut XrViewConfigurationType,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetViewConfigurationProperties(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        configurationProperties: *mut XrViewConfigurationProperties,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateViewConfigurationViews(
        instance: XrInstance,
        systemId: XrSystemId,
        viewConfigurationType: XrViewConfigurationType,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrViewConfigurationView,
    ) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateSwapchainFormats(
        session: XrSession,
        formatCapacityInput: u32,
        formatCountOutput: *mut u32,
        formats: *mut i64,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateSwapchain(
        session: XrSession,
        createInfo: *const XrSwapchainCreateInfo,
        swapchain: *mut XrSwapchain,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroySwapchain(swapchain: XrSwapchain) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateSwapchainImages(
        swapchain: XrSwapchain,
        imageCapacityInput: u32,
        imageCountOutput: *mut u32,
        images: *mut XrSwapchainImageBaseHeader,
    ) -> XrResult;
}
extern "C" {
    pub fn xrAcquireSwapchainImage(
        swapchain: XrSwapchain,
        acquireInfo: *const XrSwapchainImageAcquireInfo,
        index: *mut u32,
    ) -> XrResult;
}
extern "C" {
    pub fn xrWaitSwapchainImage(
        swapchain: XrSwapchain,
        waitInfo: *const XrSwapchainImageWaitInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrReleaseSwapchainImage(
        swapchain: XrSwapchain,
        releaseInfo: *const XrSwapchainImageReleaseInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrBeginSession(session: XrSession, beginInfo: *const XrSessionBeginInfo) -> XrResult;
}
extern "C" {
    pub fn xrEndSession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrRequestExitSession(session: XrSession) -> XrResult;
}
extern "C" {
    pub fn xrWaitFrame(
        session: XrSession,
        frameWaitInfo: *const XrFrameWaitInfo,
        frameState: *mut XrFrameState,
    ) -> XrResult;
}
extern "C" {
    pub fn xrBeginFrame(session: XrSession, frameBeginInfo: *const XrFrameBeginInfo) -> XrResult;
}
extern "C" {
    pub fn xrEndFrame(session: XrSession, frameEndInfo: *const XrFrameEndInfo) -> XrResult;
}
extern "C" {
    pub fn xrLocateViews(
        session: XrSession,
        viewLocateInfo: *const XrViewLocateInfo,
        viewState: *mut XrViewState,
        viewCapacityInput: u32,
        viewCountOutput: *mut u32,
        views: *mut XrView,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStringToPath(
        instance: XrInstance,
        pathString: *const ::std::os::raw::c_char,
        path: *mut XrPath,
    ) -> XrResult;
}
extern "C" {
    pub fn xrPathToString(
        instance: XrInstance,
        path: XrPath,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrCreateActionSet(
        instance: XrInstance,
        createInfo: *const XrActionSetCreateInfo,
        actionSet: *mut XrActionSet,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyActionSet(actionSet: XrActionSet) -> XrResult;
}
extern "C" {
    pub fn xrCreateAction(
        actionSet: XrActionSet,
        createInfo: *const XrActionCreateInfo,
        action: *mut XrAction,
    ) -> XrResult;
}
extern "C" {
    pub fn xrDestroyAction(action: XrAction) -> XrResult;
}
extern "C" {
    pub fn xrSuggestInteractionProfileBindings(
        instance: XrInstance,
        suggestedBindings: *const XrInteractionProfileSuggestedBinding,
    ) -> XrResult;
}
extern "C" {
    pub fn xrAttachSessionActionSets(
        session: XrSession,
        attachInfo: *const XrSessionActionSetsAttachInfo,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetCurrentInteractionProfile(
        session: XrSession,
        topLevelUserPath: XrPath,
        interactionProfile: *mut XrInteractionProfileState,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateBoolean(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateBoolean,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateFloat(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateFloat,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStateVector2f(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStateVector2f,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetActionStatePose(
        session: XrSession,
        getInfo: *const XrActionStateGetInfo,
        state: *mut XrActionStatePose,
    ) -> XrResult;
}
extern "C" {
    pub fn xrSyncActions(session: XrSession, syncInfo: *const XrActionsSyncInfo) -> XrResult;
}
extern "C" {
    pub fn xrEnumerateBoundSourcesForAction(
        session: XrSession,
        enumerateInfo: *const XrBoundSourcesForActionEnumerateInfo,
        sourceCapacityInput: u32,
        sourceCountOutput: *mut u32,
        sources: *mut XrPath,
    ) -> XrResult;
}
extern "C" {
    pub fn xrGetInputSourceLocalizedName(
        session: XrSession,
        getInfo: *const XrInputSourceLocalizedNameGetInfo,
        bufferCapacityInput: u32,
        bufferCountOutput: *mut u32,
        buffer: *mut ::std::os::raw::c_char,
    ) -> XrResult;
}
extern "C" {
    pub fn xrApplyHapticFeedback(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
        hapticFeedback: *const XrHapticBaseHeader,
    ) -> XrResult;
}
extern "C" {
    pub fn xrStopHapticFeedback(
        session: XrSession,
        hapticActionInfo: *const XrHapticActionInfo,
    ) -> XrResult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrColor3f {
    pub r: f32,
    pub g: f32,
    pub b: f32,
}
#[test]
fn bindgen_test_layout_XrColor3f() {
    const UNINIT: ::std::mem::MaybeUninit<XrColor3f> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrColor3f>(),
        12usize,
        concat!("Size of: ", stringify!(XrColor3f))
    );
    assert_eq!(
        ::std::mem::align_of::<XrColor3f>(),
        4usize,
        concat!("Alignment of ", stringify!(XrColor3f))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor3f),
            "::",
            stringify!(r)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).g) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor3f),
            "::",
            stringify!(g)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).b) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrColor3f),
            "::",
            stringify!(b)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrExtent3Df {
    pub width: f32,
    pub height: f32,
    pub depth: f32,
}
#[test]
fn bindgen_test_layout_XrExtent3Df() {
    const UNINIT: ::std::mem::MaybeUninit<XrExtent3Df> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrExtent3Df>(),
        12usize,
        concat!("Size of: ", stringify!(XrExtent3Df))
    );
    assert_eq!(
        ::std::mem::align_of::<XrExtent3Df>(),
        4usize,
        concat!("Alignment of ", stringify!(XrExtent3Df))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).width) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent3Df),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent3Df),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).depth) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrExtent3Df),
            "::",
            stringify!(depth)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpheref {
    pub center: XrPosef,
    pub radius: f32,
}
#[test]
fn bindgen_test_layout_XrSpheref() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpheref> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpheref>(),
        32usize,
        concat!("Size of: ", stringify!(XrSpheref))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpheref>(),
        4usize,
        concat!("Alignment of ", stringify!(XrSpheref))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).center) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpheref),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpheref),
            "::",
            stringify!(radius)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBoxf {
    pub center: XrPosef,
    pub extents: XrExtent3Df,
}
#[test]
fn bindgen_test_layout_XrBoxf() {
    const UNINIT: ::std::mem::MaybeUninit<XrBoxf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBoxf>(),
        40usize,
        concat!("Size of: ", stringify!(XrBoxf))
    );
    assert_eq!(
        ::std::mem::align_of::<XrBoxf>(),
        4usize,
        concat!("Alignment of ", stringify!(XrBoxf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).center) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBoxf),
            "::",
            stringify!(center)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).extents) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBoxf),
            "::",
            stringify!(extents)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrFrustumf {
    pub pose: XrPosef,
    pub fov: XrFovf,
    pub nearZ: f32,
    pub farZ: f32,
}
#[test]
fn bindgen_test_layout_XrFrustumf() {
    const UNINIT: ::std::mem::MaybeUninit<XrFrustumf> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrFrustumf>(),
        52usize,
        concat!("Size of: ", stringify!(XrFrustumf))
    );
    assert_eq!(
        ::std::mem::align_of::<XrFrustumf>(),
        4usize,
        concat!("Alignment of ", stringify!(XrFrustumf))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrustumf),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fov) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrustumf),
            "::",
            stringify!(fov)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nearZ) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrustumf),
            "::",
            stringify!(nearZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).farZ) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XrFrustumf),
            "::",
            stringify!(farZ)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrUuid {
    pub data: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_XrUuid() {
    const UNINIT: ::std::mem::MaybeUninit<XrUuid> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrUuid>(),
        16usize,
        concat!("Size of: ", stringify!(XrUuid))
    );
    assert_eq!(
        ::std::mem::align_of::<XrUuid>(),
        1usize,
        concat!("Alignment of ", stringify!(XrUuid))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrUuid),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpacesLocateInfo {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub baseSpace: XrSpace,
    pub time: XrTime,
    pub spaceCount: u32,
    pub spaces: *const XrSpace,
}
#[test]
fn bindgen_test_layout_XrSpacesLocateInfo() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpacesLocateInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpacesLocateInfo>(),
        48usize,
        concat!("Size of: ", stringify!(XrSpacesLocateInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpacesLocateInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpacesLocateInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).baseSpace) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(baseSpace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(time)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spaceCount) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(spaceCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).spaces) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpacesLocateInfo),
            "::",
            stringify!(spaces)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocationData {
    pub locationFlags: XrSpaceLocationFlags,
    pub pose: XrPosef,
}
#[test]
fn bindgen_test_layout_XrSpaceLocationData() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceLocationData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceLocationData>(),
        40usize,
        concat!("Size of: ", stringify!(XrSpaceLocationData))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceLocationData>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceLocationData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locationFlags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocationData),
            "::",
            stringify!(locationFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocationData),
            "::",
            stringify!(pose)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceLocations {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub locationCount: u32,
    pub locations: *mut XrSpaceLocationData,
}
#[test]
fn bindgen_test_layout_XrSpaceLocations() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceLocations> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceLocations>(),
        32usize,
        concat!("Size of: ", stringify!(XrSpaceLocations))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceLocations>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceLocations))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocations),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocations),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locationCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocations),
            "::",
            stringify!(locationCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locations) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceLocations),
            "::",
            stringify!(locations)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocityData {
    pub velocityFlags: XrSpaceVelocityFlags,
    pub linearVelocity: XrVector3f,
    pub angularVelocity: XrVector3f,
}
#[test]
fn bindgen_test_layout_XrSpaceVelocityData() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceVelocityData> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceVelocityData>(),
        32usize,
        concat!("Size of: ", stringify!(XrSpaceVelocityData))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceVelocityData>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceVelocityData))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocityFlags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocityData),
            "::",
            stringify!(velocityFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).linearVelocity) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocityData),
            "::",
            stringify!(linearVelocity)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).angularVelocity) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocityData),
            "::",
            stringify!(angularVelocity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpaceVelocities {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub velocityCount: u32,
    pub velocities: *mut XrSpaceVelocityData,
}
#[test]
fn bindgen_test_layout_XrSpaceVelocities() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpaceVelocities> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpaceVelocities>(),
        32usize,
        concat!("Size of: ", stringify!(XrSpaceVelocities))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpaceVelocities>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpaceVelocities))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocities),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocities),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocityCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocities),
            "::",
            stringify!(velocityCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).velocities) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpaceVelocities),
            "::",
            stringify!(velocities)
        )
    );
}
pub type PFN_xrLocateSpaces = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        locateInfo: *const XrSpacesLocateInfo,
        spaceLocations: *mut XrSpaceLocations,
    ) -> XrResult,
>;
extern "C" {
    pub fn xrLocateSpaces(
        session: XrSession,
        locateInfo: *const XrSpacesLocateInfo,
        spaceLocations: *mut XrSpaceLocations,
    ) -> XrResult;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerCubeKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub swapchain: XrSwapchain,
    pub imageArrayIndex: u32,
    pub orientation: XrQuaternionf,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerCubeKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerCubeKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerCubeKHR>(),
        72usize,
        concat!("Size of: ", stringify!(XrCompositionLayerCubeKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerCubeKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerCubeKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eyeVisibility) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(eyeVisibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).swapchain) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(swapchain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).imageArrayIndex) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(imageArrayIndex)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).orientation) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCubeKHR),
            "::",
            stringify!(orientation)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerDepthInfoKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub subImage: XrSwapchainSubImage,
    pub minDepth: f32,
    pub maxDepth: f32,
    pub nearZ: f32,
    pub farZ: f32,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerDepthInfoKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerDepthInfoKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerDepthInfoKHR>(),
        64usize,
        concat!("Size of: ", stringify!(XrCompositionLayerDepthInfoKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerDepthInfoKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerDepthInfoKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(subImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minDepth) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(minDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maxDepth) as usize - ptr as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(maxDepth)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nearZ) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(nearZ)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).farZ) as usize - ptr as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerDepthInfoKHR),
            "::",
            stringify!(farZ)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerCylinderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub centralAngle: f32,
    pub aspectRatio: f32,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerCylinderKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerCylinderKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerCylinderKHR>(),
        112usize,
        concat!("Size of: ", stringify!(XrCompositionLayerCylinderKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerCylinderKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerCylinderKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eyeVisibility) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(eyeVisibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(subImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).centralAngle) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(centralAngle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).aspectRatio) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerCylinderKHR),
            "::",
            stringify!(aspectRatio)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerEquirectKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub scale: XrVector2f,
    pub bias: XrVector2f,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerEquirectKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerEquirectKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerEquirectKHR>(),
        120usize,
        concat!("Size of: ", stringify!(XrCompositionLayerEquirectKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerEquirectKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerEquirectKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eyeVisibility) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(eyeVisibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(subImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scale) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bias) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirectKHR),
            "::",
            stringify!(bias)
        )
    );
}
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_HIDDEN_TRIANGLE_MESH_KHR:
    XrVisibilityMaskTypeKHR = 1;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_VISIBLE_TRIANGLE_MESH_KHR:
    XrVisibilityMaskTypeKHR = 2;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_LINE_LOOP_KHR: XrVisibilityMaskTypeKHR =
    3;
pub const XrVisibilityMaskTypeKHR_XR_VISIBILITY_MASK_TYPE_MAX_ENUM_KHR: XrVisibilityMaskTypeKHR =
    2147483647;
pub type XrVisibilityMaskTypeKHR = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrVisibilityMaskKHR {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub vertexCapacityInput: u32,
    pub vertexCountOutput: u32,
    pub vertices: *mut XrVector2f,
    pub indexCapacityInput: u32,
    pub indexCountOutput: u32,
    pub indices: *mut u32,
}
#[test]
fn bindgen_test_layout_XrVisibilityMaskKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrVisibilityMaskKHR> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrVisibilityMaskKHR>(),
        48usize,
        concat!("Size of: ", stringify!(XrVisibilityMaskKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrVisibilityMaskKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrVisibilityMaskKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertexCapacityInput) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(vertexCapacityInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertexCountOutput) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(vertexCountOutput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vertices) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(vertices)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indexCapacityInput) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(indexCapacityInput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indexCountOutput) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(indexCountOutput)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).indices) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrVisibilityMaskKHR),
            "::",
            stringify!(indices)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataVisibilityMaskChangedKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub session: XrSession,
    pub viewConfigurationType: XrViewConfigurationType,
    pub viewIndex: u32,
}
#[test]
fn bindgen_test_layout_XrEventDataVisibilityMaskChangedKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataVisibilityMaskChangedKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataVisibilityMaskChangedKHR>(),
        32usize,
        concat!("Size of: ", stringify!(XrEventDataVisibilityMaskChangedKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataVisibilityMaskChangedKHR>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrEventDataVisibilityMaskChangedKHR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataVisibilityMaskChangedKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataVisibilityMaskChangedKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).session) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataVisibilityMaskChangedKHR),
            "::",
            stringify!(session)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewConfigurationType) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataVisibilityMaskChangedKHR),
            "::",
            stringify!(viewConfigurationType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).viewIndex) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataVisibilityMaskChangedKHR),
            "::",
            stringify!(viewIndex)
        )
    );
}
pub type PFN_xrGetVisibilityMaskKHR = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        viewConfigurationType: XrViewConfigurationType,
        viewIndex: u32,
        visibilityMaskType: XrVisibilityMaskTypeKHR,
        visibilityMask: *mut XrVisibilityMaskKHR,
    ) -> XrResult,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerColorScaleBiasKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub colorScale: XrColor4f,
    pub colorBias: XrColor4f,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerColorScaleBiasKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerColorScaleBiasKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerColorScaleBiasKHR>(),
        48usize,
        concat!("Size of: ", stringify!(XrCompositionLayerColorScaleBiasKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerColorScaleBiasKHR>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrCompositionLayerColorScaleBiasKHR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerColorScaleBiasKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerColorScaleBiasKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorScale) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerColorScaleBiasKHR),
            "::",
            stringify!(colorScale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).colorBias) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerColorScaleBiasKHR),
            "::",
            stringify!(colorBias)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrLoaderInitInfoBaseHeaderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrLoaderInitInfoBaseHeaderKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrLoaderInitInfoBaseHeaderKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrLoaderInitInfoBaseHeaderKHR>(),
        16usize,
        concat!("Size of: ", stringify!(XrLoaderInitInfoBaseHeaderKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrLoaderInitInfoBaseHeaderKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrLoaderInitInfoBaseHeaderKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrLoaderInitInfoBaseHeaderKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrLoaderInitInfoBaseHeaderKHR),
            "::",
            stringify!(next)
        )
    );
}
pub type PFN_xrInitializeLoaderKHR = ::std::option::Option<
    unsafe extern "C" fn(loaderInitInfo: *const XrLoaderInitInfoBaseHeaderKHR) -> XrResult,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrCompositionLayerEquirect2KHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub layerFlags: XrCompositionLayerFlags,
    pub space: XrSpace,
    pub eyeVisibility: XrEyeVisibility,
    pub subImage: XrSwapchainSubImage,
    pub pose: XrPosef,
    pub radius: f32,
    pub centralHorizontalAngle: f32,
    pub upperVerticalAngle: f32,
    pub lowerVerticalAngle: f32,
}
#[test]
fn bindgen_test_layout_XrCompositionLayerEquirect2KHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrCompositionLayerEquirect2KHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrCompositionLayerEquirect2KHR>(),
        120usize,
        concat!("Size of: ", stringify!(XrCompositionLayerEquirect2KHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrCompositionLayerEquirect2KHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrCompositionLayerEquirect2KHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).layerFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(layerFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).eyeVisibility) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(eyeVisibility)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subImage) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(subImage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).radius) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(radius)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).centralHorizontalAngle) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(centralHorizontalAngle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).upperVerticalAngle) as usize - ptr as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(upperVerticalAngle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lowerVerticalAngle) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(XrCompositionLayerEquirect2KHR),
            "::",
            stringify!(lowerVerticalAngle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBindingModificationBaseHeaderKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrBindingModificationBaseHeaderKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrBindingModificationBaseHeaderKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBindingModificationBaseHeaderKHR>(),
        16usize,
        concat!("Size of: ", stringify!(XrBindingModificationBaseHeaderKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrBindingModificationBaseHeaderKHR>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrBindingModificationBaseHeaderKHR)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationBaseHeaderKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationBaseHeaderKHR),
            "::",
            stringify!(next)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrBindingModificationsKHR {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub bindingModificationCount: u32,
    pub bindingModifications: *const *const XrBindingModificationBaseHeaderKHR,
}
#[test]
fn bindgen_test_layout_XrBindingModificationsKHR() {
    const UNINIT: ::std::mem::MaybeUninit<XrBindingModificationsKHR> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrBindingModificationsKHR>(),
        32usize,
        concat!("Size of: ", stringify!(XrBindingModificationsKHR))
    );
    assert_eq!(
        ::std::mem::align_of::<XrBindingModificationsKHR>(),
        8usize,
        concat!("Alignment of ", stringify!(XrBindingModificationsKHR))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationsKHR),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationsKHR),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bindingModificationCount) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationsKHR),
            "::",
            stringify!(bindingModificationCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bindingModifications) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrBindingModificationsKHR),
            "::",
            stringify!(bindingModifications)
        )
    );
}
pub type XrSpacesLocateInfoKHR = XrSpacesLocateInfo;
pub type XrSpaceLocationDataKHR = XrSpaceLocationData;
pub type XrSpaceLocationsKHR = XrSpaceLocations;
pub type XrSpaceVelocityDataKHR = XrSpaceVelocityData;
pub type XrSpaceVelocitiesKHR = XrSpaceVelocities;
pub type PFN_xrLocateSpacesKHR = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        locateInfo: *const XrSpacesLocateInfo,
        spaceLocations: *mut XrSpaceLocations,
    ) -> XrResult,
>;
pub type XrColor3fKHR = XrColor3f;
pub type XrExtent3DfKHR = XrExtent3Df;
pub type XrSpherefKHR = XrSpheref;
pub type XrBoxfKHR = XrBoxf;
pub type XrFrustumfKHR = XrFrustumf;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_CPU_EXT: XrPerfSettingsDomainEXT = 1;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_GPU_EXT: XrPerfSettingsDomainEXT = 2;
pub const XrPerfSettingsDomainEXT_XR_PERF_SETTINGS_DOMAIN_MAX_ENUM_EXT: XrPerfSettingsDomainEXT =
    2147483647;
pub type XrPerfSettingsDomainEXT = ::std::os::raw::c_int;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_COMPOSITING_EXT:
    XrPerfSettingsSubDomainEXT = 1;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_RENDERING_EXT:
    XrPerfSettingsSubDomainEXT = 2;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_THERMAL_EXT:
    XrPerfSettingsSubDomainEXT = 3;
pub const XrPerfSettingsSubDomainEXT_XR_PERF_SETTINGS_SUB_DOMAIN_MAX_ENUM_EXT:
    XrPerfSettingsSubDomainEXT = 2147483647;
pub type XrPerfSettingsSubDomainEXT = ::std::os::raw::c_int;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_POWER_SAVINGS_EXT: XrPerfSettingsLevelEXT =
    0;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_SUSTAINED_LOW_EXT: XrPerfSettingsLevelEXT =
    25;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_SUSTAINED_HIGH_EXT: XrPerfSettingsLevelEXT =
    50;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_BOOST_EXT: XrPerfSettingsLevelEXT = 75;
pub const XrPerfSettingsLevelEXT_XR_PERF_SETTINGS_LEVEL_MAX_ENUM_EXT: XrPerfSettingsLevelEXT =
    2147483647;
pub type XrPerfSettingsLevelEXT = ::std::os::raw::c_int;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_NORMAL_EXT:
    XrPerfSettingsNotificationLevelEXT = 0;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_WARNING_EXT:
    XrPerfSettingsNotificationLevelEXT = 25;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIF_LEVEL_IMPAIRED_EXT:
    XrPerfSettingsNotificationLevelEXT = 75;
pub const XrPerfSettingsNotificationLevelEXT_XR_PERF_SETTINGS_NOTIFICATION_LEVEL_MAX_ENUM_EXT:
    XrPerfSettingsNotificationLevelEXT = 2147483647;
pub type XrPerfSettingsNotificationLevelEXT = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataPerfSettingsEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub domain: XrPerfSettingsDomainEXT,
    pub subDomain: XrPerfSettingsSubDomainEXT,
    pub fromLevel: XrPerfSettingsNotificationLevelEXT,
    pub toLevel: XrPerfSettingsNotificationLevelEXT,
}
#[test]
fn bindgen_test_layout_XrEventDataPerfSettingsEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataPerfSettingsEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataPerfSettingsEXT>(),
        32usize,
        concat!("Size of: ", stringify!(XrEventDataPerfSettingsEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataPerfSettingsEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEventDataPerfSettingsEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).domain) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(domain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).subDomain) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(subDomain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).fromLevel) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(fromLevel)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).toLevel) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataPerfSettingsEXT),
            "::",
            stringify!(toLevel)
        )
    );
}
pub type PFN_xrPerfSettingsSetPerformanceLevelEXT = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        domain: XrPerfSettingsDomainEXT,
        level: XrPerfSettingsLevelEXT,
    ) -> XrResult,
>;
pub type PFN_xrThermalGetTemperatureTrendEXT = ::std::option::Option<
    unsafe extern "C" fn(
        session: XrSession,
        domain: XrPerfSettingsDomainEXT,
        notificationLevel: *mut XrPerfSettingsNotificationLevelEXT,
        tempHeadroom: *mut f32,
        tempSlope: *mut f32,
    ) -> XrResult,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerEXT_T {
    _unused: [u8; 0],
}
pub type XrDebugUtilsMessengerEXT = *mut XrDebugUtilsMessengerEXT_T;
pub type XrDebugUtilsMessageSeverityFlagsEXT = XrFlags64;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_VERBOSE_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 1;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_INFO_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 16;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_WARNING_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT =
    256;
pub const XR_DEBUG_UTILS_MESSAGE_SEVERITY_ERROR_BIT_EXT: XrDebugUtilsMessageSeverityFlagsEXT = 4096;
pub type XrDebugUtilsMessageTypeFlagsEXT = XrFlags64;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_GENERAL_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 1;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_VALIDATION_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 2;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_PERFORMANCE_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 4;
pub const XR_DEBUG_UTILS_MESSAGE_TYPE_CONFORMANCE_BIT_EXT: XrDebugUtilsMessageTypeFlagsEXT = 8;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsObjectNameInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub objectType: XrObjectType,
    pub objectHandle: u64,
    pub objectName: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_XrDebugUtilsObjectNameInfoEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrDebugUtilsObjectNameInfoEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrDebugUtilsObjectNameInfoEXT>(),
        40usize,
        concat!("Size of: ", stringify!(XrDebugUtilsObjectNameInfoEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrDebugUtilsObjectNameInfoEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(XrDebugUtilsObjectNameInfoEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsObjectNameInfoEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsObjectNameInfoEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectType) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsObjectNameInfoEXT),
            "::",
            stringify!(objectType)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectHandle) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsObjectNameInfoEXT),
            "::",
            stringify!(objectHandle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectName) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsObjectNameInfoEXT),
            "::",
            stringify!(objectName)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsLabelEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub labelName: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_XrDebugUtilsLabelEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrDebugUtilsLabelEXT> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrDebugUtilsLabelEXT>(),
        24usize,
        concat!("Size of: ", stringify!(XrDebugUtilsLabelEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrDebugUtilsLabelEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(XrDebugUtilsLabelEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsLabelEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsLabelEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).labelName) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsLabelEXT),
            "::",
            stringify!(labelName)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerCallbackDataEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub messageId: *const ::std::os::raw::c_char,
    pub functionName: *const ::std::os::raw::c_char,
    pub message: *const ::std::os::raw::c_char,
    pub objectCount: u32,
    pub objects: *mut XrDebugUtilsObjectNameInfoEXT,
    pub sessionLabelCount: u32,
    pub sessionLabels: *mut XrDebugUtilsLabelEXT,
}
#[test]
fn bindgen_test_layout_XrDebugUtilsMessengerCallbackDataEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrDebugUtilsMessengerCallbackDataEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrDebugUtilsMessengerCallbackDataEXT>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrDebugUtilsMessengerCallbackDataEXT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageId) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(messageId)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).functionName) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(functionName)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).message) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(message)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objectCount) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(objectCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).objects) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(objects)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionLabelCount) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(sessionLabelCount)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionLabels) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCallbackDataEXT),
            "::",
            stringify!(sessionLabels)
        )
    );
}
pub type PFN_xrDebugUtilsMessengerCallbackEXT = ::std::option::Option<
    unsafe extern "C" fn(
        messageSeverity: XrDebugUtilsMessageSeverityFlagsEXT,
        messageTypes: XrDebugUtilsMessageTypeFlagsEXT,
        callbackData: *const XrDebugUtilsMessengerCallbackDataEXT,
        userData: *mut ::std::os::raw::c_void,
    ) -> XrBool32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrDebugUtilsMessengerCreateInfoEXT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub messageSeverities: XrDebugUtilsMessageSeverityFlagsEXT,
    pub messageTypes: XrDebugUtilsMessageTypeFlagsEXT,
    pub userCallback: PFN_xrDebugUtilsMessengerCallbackEXT,
    pub userData: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_XrDebugUtilsMessengerCreateInfoEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrDebugUtilsMessengerCreateInfoEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrDebugUtilsMessengerCreateInfoEXT>(),
        48usize,
        concat!("Size of: ", stringify!(XrDebugUtilsMessengerCreateInfoEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrDebugUtilsMessengerCreateInfoEXT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageSeverities) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(messageSeverities)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).messageTypes) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(messageTypes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userCallback) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(userCallback)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).userData) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(XrDebugUtilsMessengerCreateInfoEXT),
            "::",
            stringify!(userData)
        )
    );
}
pub type PFN_xrSetDebugUtilsObjectNameEXT = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        nameInfo: *const XrDebugUtilsObjectNameInfoEXT,
    ) -> XrResult,
>;
pub type PFN_xrCreateDebugUtilsMessengerEXT = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        createInfo: *const XrDebugUtilsMessengerCreateInfoEXT,
        messenger: *mut XrDebugUtilsMessengerEXT,
    ) -> XrResult,
>;
pub type PFN_xrDestroyDebugUtilsMessengerEXT =
    ::std::option::Option<unsafe extern "C" fn(messenger: XrDebugUtilsMessengerEXT) -> XrResult>;
pub type PFN_xrSubmitDebugUtilsMessageEXT = ::std::option::Option<
    unsafe extern "C" fn(
        instance: XrInstance,
        messageSeverity: XrDebugUtilsMessageSeverityFlagsEXT,
        messageTypes: XrDebugUtilsMessageTypeFlagsEXT,
        callbackData: *const XrDebugUtilsMessengerCallbackDataEXT,
    ) -> XrResult,
>;
pub type PFN_xrSessionBeginDebugUtilsLabelRegionEXT = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, labelInfo: *const XrDebugUtilsLabelEXT) -> XrResult,
>;
pub type PFN_xrSessionEndDebugUtilsLabelRegionEXT =
    ::std::option::Option<unsafe extern "C" fn(session: XrSession) -> XrResult>;
pub type PFN_xrSessionInsertDebugUtilsLabelEXT = ::std::option::Option<
    unsafe extern "C" fn(session: XrSession, labelInfo: *const XrDebugUtilsLabelEXT) -> XrResult,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSystemEyeGazeInteractionPropertiesEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub supportsEyeGazeInteraction: XrBool32,
}
#[test]
fn bindgen_test_layout_XrSystemEyeGazeInteractionPropertiesEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrSystemEyeGazeInteractionPropertiesEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSystemEyeGazeInteractionPropertiesEXT>(),
        24usize,
        concat!(
            "Size of: ",
            stringify!(XrSystemEyeGazeInteractionPropertiesEXT)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrSystemEyeGazeInteractionPropertiesEXT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrSystemEyeGazeInteractionPropertiesEXT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemEyeGazeInteractionPropertiesEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemEyeGazeInteractionPropertiesEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).supportsEyeGazeInteraction) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSystemEyeGazeInteractionPropertiesEXT),
            "::",
            stringify!(supportsEyeGazeInteraction)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEyeGazeSampleTimeEXT {
    pub type_: XrStructureType,
    pub next: *mut ::std::os::raw::c_void,
    pub time: XrTime,
}
#[test]
fn bindgen_test_layout_XrEyeGazeSampleTimeEXT() {
    const UNINIT: ::std::mem::MaybeUninit<XrEyeGazeSampleTimeEXT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEyeGazeSampleTimeEXT>(),
        24usize,
        concat!("Size of: ", stringify!(XrEyeGazeSampleTimeEXT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrEyeGazeSampleTimeEXT>(),
        8usize,
        concat!("Alignment of ", stringify!(XrEyeGazeSampleTimeEXT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEyeGazeSampleTimeEXT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEyeGazeSampleTimeEXT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEyeGazeSampleTimeEXT),
            "::",
            stringify!(time)
        )
    );
}
pub type XrOverlaySessionCreateFlagsEXTX = XrFlags64;
pub type XrOverlayMainSessionFlagsEXTX = XrFlags64;
pub const XR_OVERLAY_MAIN_SESSION_ENABLED_COMPOSITION_LAYER_INFO_DEPTH_BIT_EXTX:
    XrOverlayMainSessionFlagsEXTX = 1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSessionCreateInfoOverlayEXTX {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub createFlags: XrOverlaySessionCreateFlagsEXTX,
    pub sessionLayersPlacement: u32,
}
#[test]
fn bindgen_test_layout_XrSessionCreateInfoOverlayEXTX() {
    const UNINIT: ::std::mem::MaybeUninit<XrSessionCreateInfoOverlayEXTX> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSessionCreateInfoOverlayEXTX>(),
        32usize,
        concat!("Size of: ", stringify!(XrSessionCreateInfoOverlayEXTX))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSessionCreateInfoOverlayEXTX>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSessionCreateInfoOverlayEXTX))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfoOverlayEXTX),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfoOverlayEXTX),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).createFlags) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfoOverlayEXTX),
            "::",
            stringify!(createFlags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sessionLayersPlacement) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSessionCreateInfoOverlayEXTX),
            "::",
            stringify!(sessionLayersPlacement)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrEventDataMainSessionVisibilityChangedEXTX {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub visible: XrBool32,
    pub flags: XrOverlayMainSessionFlagsEXTX,
}
#[test]
fn bindgen_test_layout_XrEventDataMainSessionVisibilityChangedEXTX() {
    const UNINIT: ::std::mem::MaybeUninit<XrEventDataMainSessionVisibilityChangedEXTX> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrEventDataMainSessionVisibilityChangedEXTX>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<XrEventDataMainSessionVisibilityChangedEXTX>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).visible) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX),
            "::",
            stringify!(visible)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).flags) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrEventDataMainSessionVisibilityChangedEXTX),
            "::",
            stringify!(flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorMSFT_T {
    _unused: [u8; 0],
}
pub type XrSpatialAnchorMSFT = *mut XrSpatialAnchorMSFT_T;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub space: XrSpace,
    pub pose: XrPosef,
    pub time: XrTime,
}
#[test]
fn bindgen_test_layout_XrSpatialAnchorCreateInfoMSFT() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpatialAnchorCreateInfoMSFT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpatialAnchorCreateInfoMSFT>(),
        64usize,
        concat!("Size of: ", stringify!(XrSpatialAnchorCreateInfoMSFT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpatialAnchorCreateInfoMSFT>(),
        8usize,
        concat!("Alignment of ", stringify!(XrSpatialAnchorCreateInfoMSFT))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorCreateInfoMSFT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorCreateInfoMSFT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorCreateInfoMSFT),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pose) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorCreateInfoMSFT),
            "::",
            stringify!(pose)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).time) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorCreateInfoMSFT),
            "::",
            stringify!(time)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XrSpatialAnchorSpaceCreateInfoMSFT {
    pub type_: XrStructureType,
    pub next: *const ::std::os::raw::c_void,
    pub anchor: XrSpatialAnchorMSFT,
    pub poseInAnchorSpace: XrPosef,
}
#[test]
fn bindgen_test_layout_XrSpatialAnchorSpaceCreateInfoMSFT() {
    const UNINIT: ::std::mem::MaybeUninit<XrSpatialAnchorSpaceCreateInfoMSFT> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<XrSpatialAnchorSpaceCreateInfoMSFT>(),
        56usize,
        concat!("Size of: ", stringify!(XrSpatialAnchorSpaceCreateInfoMSFT))
    );
    assert_eq!(
        ::std::mem::align_of::<XrSpatialAnchorSpaceCreateInfoMSFT>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(XrSpatialAnchorSpaceCreateInfoMSFT)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorSpaceCreateInfoMSFT),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorSpaceCreateInfoMSFT),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anchor) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorSpaceCreateInfoMSFT),
            "::",
            stringify!(anchor)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).poseInAnchorSpace) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(XrSpatialAnchorSpaceCreateInfoMSFT),
            "::",
            stringify!(poseInAnchorSpace)
        )
    );
}
pub type PFN_xrCreateSpatialAnchorMSFT = ::std::option::Option<
